[
    {
        "description": "Le but de cet atelier est de faire collaborer des enfants et des adultes pour construire une machine a réaction en chaine avec des Lego. \r\nPendant la construction, Aurélien prendra en graphic recording (facilitation graphique) les remarques et les points marquants qui ressortiront pendant l'atelier.\r\nA la fin de l'atelier, une rétrospective sera réalisée avec les enfants pour exprimer ce qu'ils ont aimé et ce qu'ils amélioreraient s'ils pouvaient refaire l'atelier", 
        "format": "Tools-in-Action", 
        "id": "GXE-0181", 
        "speakers": [
            {
                "fullname": "Aurélien Morvant", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/d3412204cfa55cd12d488475f234b883fed3afd9"
            }, 
            {
                "fullname": "Damien ROQUEL", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/4ea2bfa2e9fce562781bc24de29f1224c2fbd4ad"
            }
        ], 
        "title": "Lego Collaboration game - adultes et enfants", 
        "track": ""
    }, 
    {
        "description": "Cette atelier ludique vous invite à vivre la vie de développeurs et d'opérationnels qui doivent mettre un produit à disposition des utilisateurs.\r\n\r\nCompétences requises: Savoir manipuler des legos \r\n\r\nA travers ce jeu, vous comprendrez l'importance du mouvement DevOps dans la réussite des projets informatiques.  ", 
        "format": "Autres formats de conférence", 
        "id": "CRS-9058", 
        "speakers": [
            {
                "fullname": "Sébastien Fauvel", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/7c553a4b165ea79bd3d66ff1ad94cc833cbe4f50"
            }
        ], 
        "title": "Lego 4 Devops", 
        "track": ""
    }, 
    {
        "description": "Vous connaissez sans doute les \"escape rooms\", ces jeux vidéos dans lesquels il faut sortir d'une salle en résolvant des énigmes... mais saviez-vous qu'il existe également des escape room \"grandeur nature\" ?\r\nL'association B.R.A.I.N. à Rennes propose ce type d'activité, avec 2 salles dans lesquelles vous êtes enfermés en équipe, avec 1 heure pour résoudre les énigmes et sortir.\r\nAyant trouvé le concept génial, j'ai proposé de les aider à réaliser leur 3ème salle en ajoutant des énigmes basées sur l'électronique, Arduino et RPi. Dans cet Hacker Space je vous présenterai quelques réalisations...\r\n", 
        "format": "Tools-in-Action", 
        "id": "FTC-0794", 
        "speakers": [
            {
                "fullname": "Sylvain Révéreault", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/79d6d96c347168a9813699bfee80e5fb40228d36"
            }
        ], 
        "title": "Des jeux et énigmes \"grandeur nature\" avec Raspberry Pi, Arduino et de l'électronique", 
        "track": ""
    }, 
    {
        "description": "Besoin de compter les moutons pour vous endormir ? Laissez faire Storm ! Alors qu'Hadoop ne vous donnera le résultat qu'à votre réveil, Storm peut le faire en temps réel.\r\n\r\nCe Tools In Action vous permettra d'une part de découvrir l'outil et son interface de gestion, mais vous montrera aussi la simplicité pour créer sa propre chaîne de traitement.", 
        "format": "Tools-in-Action", 
        "id": "VUJ-5031", 
        "speakers": [
            {
                "fullname": "Clément Juste", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b3713ee84b6c14bb7960623a4d85350299593bdf"
            }
        ], 
        "title": "Débuter avec Apache Storm", 
        "track": ""
    }, 
    {
        "description": "Apache Mesos apporte une abstraction des ressources CPU, mémoire et stockage, d'un ensemble de machines (physiques ou virtuelles). Un cluster Mesos forme un système distribué, tolérant à la panne et permettant de scaler les services déployés. Venez découvrir fonctionnalités, stratégies de déploiement, et son écosystème qui apporte scalabilité et découverte de services. Nous visiterons un cluster hébergeant une application Play, du InfluxDB, du Grafana, dont certains dans des containers Docker. Pour finir, nous jouerons au Chaos Monkey afin de prouver la résilience du système mis en place.", 
        "format": "Autres formats de conférence", 
        "id": "GFP-9786", 
        "speakers": [
            {
                "fullname": "Aurélien Maury", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/0dccad8554a9fb25ceaab997be0b3998f3d57bc3"
            }, 
            {
                "fullname": "Pablo Lopez", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/fbeacaccc082a6ecb97c53b83b7c9a6b477249a6"
            }, 
            {
                "fullname": "Jean-Baptiste Claramonte", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/0c06a5b0eb901f40f6ff992df1e7174b1dab463d"
            }, 
            {
                "fullname": "Jean-Pascal Thiery", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/27af91355b6304ad9d2387b956fc032150b2a632"
            }
        ], 
        "title": "Mesos University", 
        "track": ""
    }, 
    {
        "description": "Venez découvrir comment coder votre propre jeu de shoot 2D old school.\r\nNous verrons en détail comment fonctionnent l'animation graphique, la gestion du clavier, la musique, la détection des collisions, l'automatisation des ennemis, un peu de mathématiques et le moteur général de jeu.", 
        "format": "Conférence", 
        "id": "NVC-0472", 
        "speakers": [
            {
                "fullname": "Alan Menant", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/e59d9ce66fa118ca27689ec25f73f283c73b76ba"
            }
        ], 
        "title": "Coder son jeu de shoot 2D avec HTML5 et Javascript", 
        "track": ""
    }, 
    {
        "description": "2h pour savourer quelques morceaux choisis de la formation \"_Masterclass Expertise Java_\"  d'Olivier Croisier\r\n\r\nLa Masterclass Expertise Java est un cursus d'élite visant à former les meilleurs leaders techniques et architectes Java. En 4 jours intenses, les futurs experts acquerront une compréhension claire des principes de conception des principales API du JDK, ainsi que des détails techniques de leur implémentation. Un fort accent sera mis sur les performances, la robustesse du code et les bonnes pratiques industrielles.", 
        "format": "Hand's on Labs", 
        "id": "WLN-4787", 
        "speakers": [
            {
                "fullname": "Olivier Croisier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b462c88b3fed6718e5693cf67d530fd8ffb271a2"
            }
        ], 
        "title": "Masterclass Expertise Java", 
        "track": ""
    }, 
    {
        "description": "Kibana 4 est la dernière version de la plate-forme de visualisation d'Elastic. Elle permet de donner forme à vos données et fournit des dashboards temps réel au dessus de votre cluster Elasticsearch.\r\nDans cet atelier, nous allons parcourir toutes les étapes de construction de dashboards Kibana 4, faisant parler de manière presque instantanée de très gros volumes de données. Nous allons utiliser les fonctionnalités avancées d'Elasticsearch comme les agrégations hiérarchiques et quelques fonctionnalités phare de Kibana 4 comme la navigation avec des interfaces sophistiquées et le partage de dashboards.", 
        "format": "Hand's on Labs", 
        "id": "MTN-5373", 
        "speakers": [
            {
                "fullname": "Lucian Precup", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/e1dbce5d6e6743287401b8abdeed76408740e7de"
            }, 
            {
                "fullname": "Nicolas Giraud", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/a15d86a35bc282fd27aad3d793cd9d26ca3207b5"
            }
        ], 
        "title": "Hands on Kibana 4", 
        "track": ""
    }, 
    {
        "description": "Le site [DevConferences.org](http://www.devconferences.org) permet de lister les conférences et communautés de développeurs en France.\r\n\r\nLa version 1 actuellement en ligne est un simple site statique réalisé avec Jekyll sur Github pages. Chacun peut contribuer en faisant une pull request.\r\n\r\nL'objectif de ce Hackaton est de mettre en ligne la version 2 ! Une version plus dynamique, avec des fonctionnalités telles que la recherche avancée par ville ou catégorie, la gestion de notifications, la gestion d'agendas, des statistiques sur les conférences, etc ...", 
        "format": "Hackaton", 
        "id": "EAW-9531", 
        "speakers": [
            {
                "fullname": "Sébastien Prunier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/809da953e557d60714a52cbc655ea3483f43e1cb"
            }, 
            {
                "fullname": "Chris Woodrow", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/02496209ad79f5f33926319d1ddeaba80fde9dfd"
            }, 
            {
                "fullname": "Mathieu ANCELIN", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/311bcc7b196c80dd4ee5236f06872a951982aa3e"
            }
        ], 
        "title": "DevConferences, l'annuaire des conférences et communautés de développeurs en France", 
        "track": ""
    }, 
    {
        "description": "Un projet Java EE pour faire du CRUD c'est : 4j pour un pom.xml, 12j pour les entities, 24j pour une couche de service, 19j pour des pages web et 11j pour écrire les tests! Mais non !!! Je vous fais tout ça en 30 minutes top chrono avec JBoss Forge.... et j'aurai même le temps de vous montrer les entrailles de Forge et comment l'étendre pour répondre à vos besoins.", 
        "format": "Tools-in-Action", 
        "id": "OHD-9075", 
        "speakers": [
            {
                "fullname": "Antonio Goncalves", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/17b46aebf003f4795a92cd2fe66ba1d3d88436f5"
            }
        ], 
        "title": "Java EE en 30 minutes", 
        "track": ""
    }, 
    {
        "description": "Le CSS est un pilier de la programmation Web et son intérêt n’est plus à justifier. Pourtant il ne suscite pas franchement l’enthousiasme parmi de nombreux développeurs. Cela se traduit généralement par des développements “à défaut” pour en arriver à des feuilles de styles chaotiques lors de la maintenance.\r\n\r\nDans cette session, voyons pourquoi il est temps de s’y intéresser sérieusement et surtout comment reprendre le contrôle d’une production CSS de qualité et maîtrisée grâce à un outillage adapté.", 
        "format": "Tools-in-Action", 
        "id": "QHI-8405", 
        "speakers": [
            {
                "fullname": "Alvin Berthelot", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/237a3dc45ec7650188bce38e5797edbbf5c33511"
            }
        ], 
        "title": "Les bons outils CSS font les bons ouvriers du Web", 
        "track": ""
    }, 
    {
        "description": "Nous proposons ici de relever un challenge simple en construisant un robot qui est capable de mouvement\r\nles fonctionnels définiront les US\r\nles développeurs/testeurs programmeront le robot et le construirons\r\nBien sur le tout, sans plan et en appliquant une méthode agile\r\nSeul pré-requis : avoir 10 ou plus\r\n", 
        "format": "Hand's on Labs", 
        "id": "BDY-5360", 
        "speakers": [
            {
                "fullname": "Aurélien Morvant", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/d3412204cfa55cd12d488475f234b883fed3afd9"
            }, 
            {
                "fullname": "Simon JAILLAIS", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/2a1447e32cf9a054dca4322d432420cb883056ac"
            }
        ], 
        "title": "Mindstorms4Scrum - l'agilité en codant", 
        "track": ""
    }, 
    {
        "description": "Vous souhaitez voir à quoi ressemble un environnement de travail connecté ? Venez voir notre expérience du Studio connecté !\r\nDe l’installation des capteurs dans les bureaux du Studio à l’envoi des données via MQTT  et leur analyse, à la visualisation des informations à travers une application mobile, vous saurez tout sur notre démarche !\r\nMais surtout venez découvrir nos retours sur cette expérience, nos impressions et celles de nos collègues du Studio...\r\n\r\n", 
        "format": "Conférence", 
        "id": "BWN-5658", 
        "speakers": [
            {
                "fullname": "Sameh BEN FREDJ", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/de652738867f1132700f7f659bb6c7a4c2a024f8"
            }, 
            {
                "fullname": "Qian Jin", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/aa61131dd3937414f72bbc62d120987ef2204502"
            }
        ], 
        "title": "On a connecté le Studio !", 
        "track": ""
    }, 
    {
        "description": "Je voudrais vous partager quelques petits secrets. Comment, dans une startup qui livre tous les jours, développer sur le long terme, mener à bien des chantiers lourds, impliquant par exemple des changements d'infrastructures, des renommages ou des changements de technologies ?\r\n\r\nIl s'agit de refactoring, à différentes échelles. Mais une entreprise sous pression ne se prête pas aux grands chantiers. Il vous faut agir vite et discrètement.\r\n\r\nPour ce faire, j'ai ma technique : la technique de la bulle.\r\n\r\ngit, du scripting, beaucoup de rigueur et un peu d'ingéniosité en sont les ingrédients.", 
        "format": "Conférence", 
        "id": "PRB-2103", 
        "speakers": [
            {
                "fullname": "Frédéric Menou", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b83bea316afe36c9bcb224487bab9ef93448c12d"
            }
        ], 
        "title": "La technique de la bulle", 
        "track": ""
    }, 
    {
        "description": "Imaginez un projet d’envergure mené en SCRUM avec un backlog constitué d’une multitude d’US plus ou moins organisées. Pensez-vous que ce Backlog ayant l’emprunte forte de la vie courante du BUILD puisse constituer votre référentiel fonctionnel ? Nous pensons que non et nous vous proposons d’aborder l’approche BDD que nous avons mis en œuvre avec cucumber. Mais ce n’est pas tout, cette approche nous a permis de renforcer la pluridisciplinarité de l’équipe de delivery dont chacun des éléments contribue à la constitution du référentiel.\r\n\r\nTags: BDD, Cucumber, outils, automatisation", 
        "format": "Conférence", 
        "id": "KAG-5932", 
        "speakers": [
            {
                "fullname": "Renan Michaud", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/6583ecd18f37d1cc3fd0aa851c3d2077c78da20a"
            }, 
            {
                "fullname": "Cyrille CAILLAUD", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/749ca65e4d4d58a7e72798fee4d4bf0ab093997d"
            }
        ], 
        "title": "BDD & Cucumber - features first", 
        "track": ""
    }, 
    {
        "description": "Desired State Configuration.. quelle expression bizarre! Dans cette session, vous pourrez découvrir comment il est possible de scripter son infrastructure dans Azure de manière déclarative et de faire du test unitaire, le tout uniquement en PowerShell. ", 
        "format": "Tools-in-Action", 
        "id": "CJQ-5273", 
        "speakers": [
            {
                "fullname": "Fabien Dibot", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/20f258299c7baf1f0f03433f448bd7b9c185379d"
            }
        ], 
        "title": "Infrastructure as a code avec PowerShell DSC", 
        "track": ""
    }, 
    {
        "description": "Et si le système de modules de Node.js, simple et efficace, pouvait améliorer notre quotidien de développeurs front-end ?\r\n\r\nL’outil Browserify nous propose d’adopter les standards de modularisation de Node.js pour structurer nos clients web. Il nous offre également l’opportunité de gérer nos dépendances avec npm et de bénéficier ainsi de ce formidable écosystème.\r\n\r\nAprès une rapide introduction du système de modules de Node.js et de Browserify, un live-coding présentera les bénéfices d’une modularisation “à la Node.js” d’une application AngularJS.", 
        "format": "Tools-in-Action", 
        "id": "EYM-5983", 
        "speakers": [
            {
                "fullname": "Antoine Richard", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/dd64536a0be4bd06086472603102f227130f3ced"
            }
        ], 
        "title": "Modulariser son application AngularJS avec Browserify", 
        "track": ""
    }, 
    {
        "description": "The W3C has been working on a Web Components standard for almost three years, but it is still a work in progress. But polyfills like allows current developers to use Web Components today, and incorporate to their apps widgets from any library  of web components. The best known of these libraries is Google's Polymer. In this lab you will use Material Design Polymer Elements on to design and develop a web application using web components.\r\n\r\nYou will learn to use the following technologies:\r\n- Polymer and Web Components (for mobile and desktop)\r\n- The Paper Elements for Polymer (material design)\r\n\r\nMandatory Installs prior to lab:\r\n+ npm \r\n+ bower\r\n+ your favorite HTML/CSS/JS IDE (I suggest Sublime Text)", 
        "format": "Hand's on Labs", 
        "id": "PPU-2384", 
        "speakers": [
            {
                "fullname": "Horacio Gonzalez", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/1a6ffd3489d3859681ce34f593ea3b8edb6cfaeb"
            }, 
            {
                "fullname": "Audrey Neveu", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/9d720104445df34116c00ebf208e03404dfdb1b6"
            }
        ], 
        "title": "Hand's on Web Components with Polymer", 
        "track": ""
    }, 
    {
        "description": "Mal coder n’est pas une maladie ! Tout développeur passe par cette phase et cela peut provoquer un choc traumatique qui peut ressurgir des semaines, des mois voire des années après l’évènement. Les plus fragiles n’arrivent pas à faire face à cette souffrance et commettent des actes irréparables comme l’abandon du développement ou pire, s’entourent de logiciels aguicheurs promettant de créer des applications sans code ! Pour s’en sortir, il est important de comprendre ce que l’on vit et de se faire aider. Ce quickie est là pour aider les développeurs en souffrance. Vous pouvez vous en sortir !", 
        "format": "Quickie", 
        "id": "LQY-9418", 
        "speakers": [
            {
                "fullname": "Ellène Dijoux Siber", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/3d5f08caa8f71b11f4ecd0968cbdec1d4855050f"
            }
        ], 
        "title": "Savoir faire le deuil de son code", 
        "track": ""
    }, 
    {
        "description": "Avec des versions différentes du progiciel simultanément chez de nombreux clients, pourquoi avons-nous décidé de passer de SVN à Git ? Pourquoi notre choix s’est-il porté sur le modèle GitFlow pour gérer toutes les branches ? Comment s’est déroulée cette migration ? Et surtout, sommes-nous satisfaits du résultat ? ", 
        "format": "Quickie", 
        "id": "NFI-6145", 
        "speakers": [
            {
                "fullname": "Cécilia Bossard", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/25ad846ddc852cf72537bced0f9aed8b9042df84"
            }
        ], 
        "title": "Comment git a sauvé notre projet (ou presque)", 
        "track": ""
    }, 
    {
        "description": "The recent unveiling of Android Wear introduced a brand new set of challenges and opportunities for application designers and developers. Indeed, wearable computing requires designers to think in a radically different manner while offering tremendous new ways to improve people lives. This session acts as a complete overview of the new Android Wear ecosystem and explains how developers can push their existing apps to the wearable level from both a designer and a developer perspective.", 
        "format": "Conférence", 
        "id": "HRG-4766", 
        "speakers": [
            {
                "fullname": "Cyril Mottier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/2e15eb74e12b2ced91aeb74046a72c2bf587d150"
            }
        ], 
        "title": " Introduction to Android Wear - A Glimpse Into the Future", 
        "track": ""
    }, 
    {
        "description": "ASP.Net 5 a pour vocation de réconcilier la puissance de .NET avec les besoins de modularité et d'efficacité des plateformes web modernes. \r\nDans cette session, nous présenterons les principaux caractéristiques et changements de cette nouvelle version, l'évolution d'ASP.NET MVC dans sa version 6, les nouveautés apportées par Visual Studio 2015 dans ce domaine et les impacts des aspects open source et cross-platform d'ASP.NET 5.", 
        "format": "Conférence", 
        "id": "NJF-3989", 
        "speakers": [
            {
                "fullname": "Benjamin Talmard", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/83029e503504b1c72a5afa1538360aca8219dd84"
            }, 
            {
                "fullname": "Jean-Philippe Gouigoux", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/d57dff8f63cbe3a40a1c748d4c6314cbb1088afc"
            }
        ], 
        "title": "ASP.NET 5  et MVC 6 : la révolution est en marche", 
        "track": ""
    }, 
    {
        "description": "L'expérience utilisateur est une discipline peu connue et encore très négligée en France, en particulier lors de la conception d'applications métier. Pourtant, une bonne ergonomie améliore la productivité et facilite l'adoption par les usagers.\r\nDans beaucoup de projets, en particulier en mode agile, le développeur participe à la définition de l'interface et des fonctionnalités. Cette conférence le sensibilisera à l'importance de l'expérience utilisateur et lui donnera quelques clés pour savoir comment l'améliorer. ", 
        "format": "Conférence", 
        "id": "VMG-5038", 
        "speakers": [
            {
                "fullname": "Florence Herrou", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/16f904190645256456e417859b692ecb03e0c8f1"
            }
        ], 
        "title": "L'expérience utilisateur est importante pour nous", 
        "track": ""
    }, 
    {
        "description": "Vous avez cédé à la mode des applications JavaScript, que ce soit pour le Front ou bien en full stack. Mais comment allez vous débuguer votre application ? Avec des “alert” ?\r\nSaviez vous que les consoles des navigateurs peuvent mettre en forme les objets ou bien résoudre les piles d’appels asynchrones ? Avez-vous déjà essayé de modifier des valeurs ou carrément des fonctions pendant un débogage ?\r\n\r\nAu cours de ce tools in action, nous ferons un panorama des outils de débogage pour JavaScript et des possibilités qu’offre ce langage.\r\n", 
        "format": "Tools-in-Action", 
        "id": "FTJ-9395", 
        "speakers": [
            {
                "fullname": "Christophe Jollivet", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/024fb98ae59f59139731aa5ee8cf024f510278c7"
            }
        ], 
        "title": "Déboguage de JavaScript", 
        "track": ""
    }, 
    {
        "description": "Créer une application c’est chouette mais créer pour plusieurs plateformes (Android, iOs, ChromeOS…) deviens vite fastidieux. Et si on essayait de créer une seule application que l'on pourrait générer pour ces plateformes? Et pourquoi on n'essaierait pas de la faire à l'aide des outils de génération multiplateforme comme Cordova et PhoneGap, de Ionic (s’appuyant sur ces outils de génération) et  des technologies web (HTML, CSS, AngularJS...)? Lors de ce TIA, je vous propose de créer une application en live à l’aide de Ionic.", 
        "format": "Tools-in-Action", 
        "id": "XOF-2187", 
        "speakers": [
            {
                "fullname": "Stéphanie MOALLIC", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/4f3604eb9c7a1e202a936dc045b0c39b98e76efa"
            }
        ], 
        "title": "Développer des applications multiplateformes facilement à l'aide de Ionic", 
        "track": ""
    }, 
    {
        "description": "Il parait que créer une API pour votre app Angular c'est simple ! Quand il s'agit de la sécuriser, votre API se transforme souvent en \"usine à  lisier\"... Avec des solutions souvent contre performantes et une complexité inutile et bien de triviales failles de sécurité.\r\nPourtant cypher, tokens, hash et autres \"time based algorithms\" sont vos meilleurs alliés. Venez découvrir comment la cryptographie vous permet de renforcer structurellement votre API sans complexifier son interface.", 
        "format": "Conférence", 
        "id": "MHR-6960", 
        "speakers": [
            {
                "fullname": "Sébastien Lambour", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/3ead0851d2ea4a1a93385626497d268b7d53f962"
            }
        ], 
        "title": "Cryptography : THE swiss army knife of secured APIs", 
        "track": ""
    }, 
    {
        "description": "Dans cette session, je présenterai CDI (Contexte & Dependency Injection), expliquerai la plupart des concepts (injection, alternatives, producteurs, intercepteurs, décorateurs, événements ...), mais aussi vous montrerai pourquoi CDI est devenu la spécification principale de Java EE (tout simplement car elle utilisée dans la plupart des spécifications Java EE ;o). Tout ceci avec un doux mélange de slides et de démos qui fonctionnent (aidé de JBoss Forge et JRebel). CDI 2.0 étant dans les starting blocks, je terminerai la session en vous donnant la feuille de route de cette nouvelle version.", 
        "format": "Conférence", 
        "id": "ZGZ-8998", 
        "speakers": [
            {
                "fullname": "Antonio Goncalves", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/17b46aebf003f4795a92cd2fe66ba1d3d88436f5"
            }
        ], 
        "title": "Venez découvrir CDI, la perle de Java EE !", 
        "track": ""
    }, 
    {
        "description": "Faire son propre clavier, du matériel au logiciel, mais diable pourquoi ? Mais diable comment ? Nous répondrons à toutes ces questions que vous ne vous êtes jamais posées.", 
        "format": "Quickie", 
        "id": "EXS-7794", 
        "speakers": [
            {
                "fullname": "Guillaume Collic", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/8a4f3f1fee2feefab582e98253bbbad2df4bd236"
            }
        ], 
        "title": "Forger son propre clavier. Pourquoi ? Comment ?", 
        "track": ""
    }, 
    {
        "description": "Vous voulez exposer votre tablette à vos clients, leurs donner accès à une application sans pour autant qu'ils puissent installer d'applications ou changer les paramètres ? C'est conférence est pour vous !\r\n \r\nUne des nouveautés d'Android Lollipop est d'apporter un ensemble d'API \"pour les espaces de travail et l'éducation\". Nous verrons, en 15 minutes, comment tirer parti de ces API - notamment  autour du Screen Pinning et du Device Policy Manager -  pour créer une application Android Lollipop (API 21) type \"Kiosque\", pour restreindre les utilisateurs à n'utiliser qu'une application spécifique. \r\n\r\nCe talk peut répondre à des besoins clients précis qui souhaitent ouvrir leurs tablettes au public tout en en limitant l'usage : showrooms, agences & services publics, bar & restaurants, centre aérés, écoles, etc..", 
        "format": "Quickie", 
        "id": "NYC-2865", 
        "speakers": [
            {
                "fullname": "Florent DUPONT", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/401ad1a4b71994b15f558c88c750d86133e3f00f"
            }
        ], 
        "title": "Créez une véritable application kiosque avec Android Lollipop", 
        "track": ""
    }, 
    {
        "description": "L'analyse statique permet de detecter des bugs et des problèmes dans votre code sans l'executer. Cette présentation vous promet, en toute simplicité, d'ecrire votre propre analyseur pour Java basé sur SonarQube. Pour y arriver il faudra comprendre les challenges d'analyse du langage, du parsing à l'execution symbolique,  pour pouvoir coder des vérifications specifiques à vos projets ! ", 
        "format": "Conférence", 
        "id": "OTL-6921", 
        "speakers": [
            {
                "fullname": "Nicolas PERU", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/5d1d12db41e59e80952d00f33c6473432edd49a9"
            }
        ], 
        "title": "DIY : Java Static Analysis", 
        "track": ""
    }, 
    {
        "description": "C'est l'histoire d'un mec qui voulait jouer avec un Launchpad pour devenir le prochain Daft Punk. Mais comme c'était plus difficile que prévu, il a préféré développer une API Java pour piloter l'appareil et lui trouver des usages inattendus. \r\n\r\nPuis, comme tout le monde n'a pas de Launchpad chez soi, le mec (sympa) a développé un émulateur web temps réel ultra-moderne avec du Vertx embedded, des websockets et du SVG.\r\n\r\nVous l'avez deviné, le mec en question, c'est moi, et je vous attends nombreux pour une session colorée et interactive !", 
        "format": "Conférence", 
        "id": "YKG-8055", 
        "speakers": [
            {
                "fullname": "Olivier Croisier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b462c88b3fed6718e5693cf67d530fd8ffb271a2"
            }
        ], 
        "title": "LP4J, a song of Java, MIDI and websockets", 
        "track": ""
    }, 
    {
        "description": "With tens of millions of clients continuously downloading binaries from our repositories, we decided to offer an OSS client that natively supports these downloads.\r\nIn this talk, we will share the main challenges in developing a highly-concurrent, resumable, async download library on top of Apache HTTP client. We will cover other libraries we tested and why we decided to reinvent the wheel. We will see important pitfalls we came across when working with HTTP and how using the right combination of techniques can improve performance by an order of magnitude. We will also see why your initial assumptions may completely change when faced with other players on the network.\r\nConsider yourself forewarned: lots of HTTP internals, NIO and concurrency ahead!", 
        "format": "Conférence", 
        "id": "BND-7435", 
        "speakers": [
            {
                "fullname": "Fred Simon", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/099381b9b1baa7d47ee44b93cc7113db64774c4e"
            }
        ], 
        "title": "Everything you wanted to know about writing async, high-concurrency HTTP applications in Java, but were afraid to ask", 
        "track": ""
    }, 
    {
        "description": "L'internet des objets est un sujet 'hype' et de nombreux joujous sortent régulièrement sur le marché. Seuls, ces objets vous lasseront vite ! Il faut un moyen de les faire communiquer et pouvoir récupérer (et traiter) les données associées.\r\nMQTT est un protocole standardisé récemment à l'OASIS. Il est conçu (entre autre) pour les objets connectés et est donc un incontournable du domaine.\r\nAu delà de la présentation du protocole, cette présentation montrera MQTT en action avec du code et des démos avec des objets variés (dont un clone du thermostat NEST réalisé en DIY).", 
        "format": "Tools-in-Action", 
        "id": "KHP-2295", 
        "speakers": [
            {
                "fullname": "Laurent HUET", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/250af81330bb52de5dfae8dce450d5b72191419f"
            }
        ], 
        "title": "MQTT en action", 
        "track": ""
    }, 
    {
        "description": "Open BCI est un électro-encéphalogramme en kit opensource (Brain Computer Interface) permettant de lire les différentes ondes provenant de nos cerveaux (EEG), de nos muscles (EMG) et de notre coeur (EKG). Grâce aux outils fournis avec le kit et à la nature opensource du projet, les possibilités sont sont infinies :-)\r\n\r\nDans cette session nous verrons comment accéder à toutes les mesures offertes par le kit, comment les traiter et peut-être comment piloter vos application par la pensée à travers divers exemples et démos. ", 
        "format": "Tools-in-Action", 
        "id": "VWC-7991", 
        "speakers": [
            {
                "fullname": "Mathieu ANCELIN", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/311bcc7b196c80dd4ee5236f06872a951982aa3e"
            }
        ], 
        "title": "OpenBCI ou comment lire dans les pensées en Java", 
        "track": ""
    }, 
    {
        "description": "Terraform est un outil Open-Source, développé en Go, développé par les créateurs de Vagrant, Packer, Consul & Serf. \r\n\r\nQuand Les outils comme Puppet, Chef ou Ansible vous permettent de provisionner des machines déjà en place, Terraform permet de manager une infrastructure virtuelle de manière déclarative, et multi-providers.\r\n\r\nDans ce talk, nous parlerons d’”Infrastructure as Code” et présenterons comment Terraform fonctionne et comment  en profiter rapidement et efficacement ,le tout agrémenté d'un retour d’expérience de son utilisation pour gérer des infrastructures actuellement en production.", 
        "format": "Conférence", 
        "id": "QSZ-1636", 
        "speakers": [
            {
                "fullname": "Julien Vey", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/692376e644585a27aafad9aa2274ec26f7645715"
            }, 
            {
                "fullname": "Éric Bellemon", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/9624d8599ea99dd116179ab5afd4054093564d2c"
            }
        ], 
        "title": "Sculpter votre infrastructure avec Terraform", 
        "track": ""
    }, 
    {
        "description": "Si l'intérêt de Docker pour les environnements de développement et le packaging est incontestable, les choses peuvent se compliquer lorsqu'il s'agit de pousser les containers jusqu'en prod. Dans cette conférence le Dev (Nicolas) et l'Ops (Sylvain) discuteront des possibilités offertes par Docker et son écosystème pour répondre aux enjeux de production tels que la sécurité, la performance et l'exploitabilité.", 
        "format": "Conférence", 
        "id": "DDO-8160", 
        "speakers": [
            {
                "fullname": "Sylvain Révéreault", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/79d6d96c347168a9813699bfee80e5fb40228d36"
            }, 
            {
                "fullname": "Nicolas De loof", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/f501a00c32061ea929c2fd75bcd36210218c7878"
            }
        ], 
        "title": "[Le Dev et l'Ops] Docker en production ?", 
        "track": ""
    }, 
    {
        "description": "La grammaire de Java contient certaines subtilités syntaxiques qui permettent, par hasard ou mesquinerie, de jouer avec les nerfs de vos collègues. \r\nAvouez que ce serait dommage de s'en priver !", 
        "format": "Quickie", 
        "id": "EGH-3031", 
        "speakers": [
            {
                "fullname": "Olivier Croisier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b462c88b3fed6718e5693cf67d530fd8ffb271a2"
            }
        ], 
        "title": "F**k your code - with style", 
        "track": ""
    }, 
    {
        "description": "La sécurité, pourtant primordiale dans nos SI, est souvent négligée par incompréhension et considérée comme la responsabilité d'experts en cryptographie moléculaire.\r\n\r\nPourtant, en tant que dev / ops, j'ai été amener à diagnostiquer des problèmes obscures de certificats avec des messages d'erreurs qui sont souvent incompréhensible.\r\n\r\nMais je m'en suis sortie et ce domaine n'est en fait pas si complexe si on prend 15 minutes pour l'expliquer.", 
        "format": "Quickie", 
        "id": "ZXE-2599", 
        "speakers": [
            {
                "fullname": "Mathieu Pousse", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b4e1b616e00e912a30cab347d346a5831b8cc029"
            }
        ], 
        "title": "Security matters", 
        "track": ""
    }, 
    {
        "description": "Cette présentation est une introduction à Docker. Elle s'adresse à des\r\npersonnes qui connaissent l'environnement Linux, ont entendu parler de\r\nDocker est se demandent ce que c'est, comment ça fonctionne, pourquoi\r\ntout le monde en parle et surtout, concrètement, ce que ça permet de faire.\r\n\r\nLa première partie présente ce qu'est un conteneur, en partant d'un sac\r\nà dos et se termine par une présentation de Docker \"vue d'hélicoptère\"\r\net expliquant sur quoi Docker est construit.\r\n\r\nLa deuxième partie entre dans le vif sujet avec un cas concret. Elle\r\nmontre comment installer le couple Ghost/MySQL dans Docker en\r\nréutilisant une image du hub et \"dockerisant\" Ghost. Ce qui permet de\r\nprésenter les principales bonne pratiques.\r\n\r\nEn conclusion, elle ajoute quelques pistes pour aller plus loin, en\r\nparticulier docker-compose qui permet de rejouer l'ensemble de la\r\ndeuxième partie en une seule commande.", 
        "format": "Conférence", 
        "id": "SGC-7345", 
        "speakers": [
            {
                "fullname": "Jean-Tiare Le Bigot", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/92aeb26e2f1d8e6962ac3e8cc5ab294b9b970c4e"
            }
        ], 
        "title": "Premiers pas avec Docker", 
        "track": ""
    }, 
    {
        "description": "L'approche SDN vise à apporter la même souplesse d'administration et d'utilisation de la couche réseau que celle apportée par les outils de Cloud Management sur les couches systèmes et virtualisation, en permettant de manipuler le réseau par des APIs, complétant ainsi l'approche \"infrastructure as code\".\r\nCe talk a pour but de présenter les principaux concepts de l'approche SDN (architecture, protocoles, outils), d'illustrer par quelques cas d'usage et démonstrations, et de parler de l'avancement du chantier SDN ainsi que de ses limitations.", 
        "format": "Conférence", 
        "id": "XXU-3862", 
        "speakers": [
            {
                "fullname": "Sylvain Révéreault", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/79d6d96c347168a9813699bfee80e5fb40228d36"
            }
        ], 
        "title": "Introduction au Software Defined Networking", 
        "track": ""
    }, 
    {
        "description": "How to mix SQL and NoSQL worlds without a revolution?\r\n\r\nThis live coding talk will show you how to add elasticsearch in your legacy application without changing all your habits. Your application will be able to have advanced search features without the need of writing complex SQL code!\r\n\r\nDavid will start from a RestX, Hibernate, Postgresql application and will add live during this session a complete integration of elasticsearch:\r\n\r\n* Why should we add NoSQL search?\r\n* bad practices (JDBC river, external batch...)\r\n* how to represent business entities in NoSQL documents?\r\n* elasticsearch beyonder project\r\n* How to live without transactions inside a transactional application?\r\n", 
        "format": "Conférence", 
        "id": "TNY-9911", 
        "speakers": [
            {
                "fullname": "David Pilato", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/a0249ef2f61a29025b325afb7e76bb256412576e"
            }
        ], 
        "title": "Advanced search for your legacy application", 
        "track": ""
    }, 
    {
        "description": "Pour un service support client, respecter le SLA est un objectif primordial. Le non respect des différents niveaux SLA pourraient avoir des conséquences désastreuses surtout en cas de crise. \r\nAvec les outils tels que Docker, il devient plus facile de maintenir les environnements \"semblables\" à ceux du client et de pouvoir reproduire quasi-immédiatement le problème reporté. L'équipe est donc capable d'apporter au client une réponse satisfaisante plus rapidement. \r\nCela permet d'améliorer la réactivité/productivité de l'équipe, donc de respecter le SLA engagé.", 
        "format": "Tools-in-Action", 
        "id": "IAQ-2630", 
        "speakers": [
            {
                "fullname": "Hung BUI", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/ecb1cb28fb9a22e6a6ad3b9b3cd6089637ac7a35"
            }
        ], 
        "title": "Merci Docker, tu m'as aidé à respecter les SLA de mon service Support Client.", 
        "track": ""
    }, 
    {
        "description": "[Gulp](http://gulpjs.com/) est un module node.js de gestion des différentes étapes de construction (build) d'une application.\r\n\r\nCet atelier sera animé par Matthieu BRECHET et Loïc TRUCHOT sous la forme d'un Tools In Action (on vous fait découvrir l'outil dans des conditions réelles).\r\n\r\nNiveau requis : les bases du développement en JavaScript\r\n", 
        "format": "Tools-in-Action", 
        "id": "KRN-1003", 
        "speakers": [
            {
                "fullname": "Loïc Truchot", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/11fd8eec8ef916bd8e882c0b707b2dc6c715e028"
            }, 
            {
                "fullname": "Matthieu Bréchet", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b1f772b5cf753f38775a68a12624814f57ab9c12"
            }
        ], 
        "title": "Gulp Fiction : surveiller, tester, builder, livrer... sans tomber dans les poms", 
        "track": ""
    }, 
    {
        "description": "Il y a quelques mois j'ai eu l'occasion de me _brutaliser_ en commençant une mission Erlang.\r\nCe passage a été difficile mais très instructif car Erlang a _une philosophie_ qui en fait vraiment un langage à part. Ce talk donnera donc un  feedback sur ce changement, du point de vue d'un ex-développeur Android/Java.\r\nAu passage, je vous montrerais le quotidien d'un développeur Erlang et ce qui se passe dans sa tête!", 
        "format": "Conférence", 
        "id": "YTT-5400", 
        "speakers": [
            {
                "fullname": "Olivier Gonthier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/f96bd89a914525fd0a2d7f83795e3af85667c519"
            }
        ], 
        "title": "De Java à Erlang, je suis toujours vivant!", 
        "track": ""
    }, 
    {
        "description": "En années de chien... euh d'Open Source, c'est un projet très mature, comme le prouve ses 4.5 millions de téléchargements par an ! Le langage Groovy est certainement le langage alternatif le plus utilisé aujourd'hui sur la JVM.\r\nMais comment est on passé d'un hobby à un projet professionnel sponsorisé ? Quid de ses récents déboires niveau funding ? Etre contributeur alors que d'autres sont payés, est-ce un problème ?\r\n\r\nVenez découvrir l'histoire du langage, ses réussites, ses drames, ses rebondissements, suspens assuré !\r\n\r\nCe talk sera aussi l'occasion de discuter de l'Open Source professionnel !", 
        "format": "Conférence", 
        "id": "WWD-5815", 
        "speakers": [
            {
                "fullname": "Guillaume Laforge", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/56c19f66be390dbf4093c4064a0797289b38c66c"
            }, 
            {
                "fullname": "Cédric Champeau", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/0db6540bc3b90622c8142ec596981ced1c13d4a3"
            }
        ], 
        "title": "Groovy, son histoire, son oeuvre !", 
        "track": ""
    }, 
    {
        "description": "Rust est un langage de programmation orienté systèmes dont les performances se veulent équivalentes au C mais qui au contraire du C évite quasiment tous les crashs et élimine les problèmes lors de concurrence sur l'accès aux données.\r\nAprès avoir beaucoup évolué syntaxiquement et sémantiquement le langage se stabilise pour la version 1.0 en cours de finalisation.\r\n\r\nSi vous en avez marre du C/C++ et recherchez un langage plus sûre, si vous venez du monde web et voulez faire du bas niveau sans vous brûler sur les pointeurs, venez découvrir Rust.\r\n", 
        "format": "Conférence", 
        "id": "BKA-5177", 
        "speakers": [
            {
                "fullname": "Christophe Augier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/23fbec879b9b14daba85d935cf4be1b8341a3ec6"
            }
        ], 
        "title": "Introduction à Rust", 
        "track": ""
    }, 
    {
        "description": "\"Quand on est un vrai développeur, on ne fait pas de PHP !\" C'est, dans l'esprit, une remarque assez courante dans le milieu du développement. Il y a du vrai dans les propos lancés contre ce langage, mais cela fait-il avancer le débat ? Laissez moi vous parler de PHP, son passé, son présent et son futur. Car une technologie, qui fait fonctionner autant de sites Internet à très fort trafic, ne peut pas avoir que des mauvais cotés ... ", 
        "format": "Conférence", 
        "id": "JOH-4392", 
        "speakers": [
            {
                "fullname": "Frederic Bouchery", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/75807110bd0329b4c1ccf1bd35d8e827844543ed"
            }
        ], 
        "title": "Pourquoi PHP ?", 
        "track": ""
    }, 
    {
        "description": "Les APIs sont partout, à tous les coins de rue du Web !\r\nDe préférence, soyons \"rest\", dans le style, pour être hip.\r\nEt pour être encore plus hype, qu'est-ce qu'on peut faire de fun avec Groovy et ses APIs ?\r\nDans cette session, je vous proposer de nous intéresser à ces APIs Web, à l'interaction qu'on peut avoir avec un langage tel que Groovy, comment les tester avec Spock pour le petit côté \"Enterprise\".", 
        "format": "Conférence", 
        "id": "WGE-9820", 
        "speakers": [
            {
                "fullname": "Guillaume Laforge", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/56c19f66be390dbf4093c4064a0797289b38c66c"
            }
        ], 
        "title": "Rest groovy, man!", 
        "track": ""
    }, 
    {
        "description": "Tu as déjà vu de jolies graphiques sur le Web créés avec D3js et tu te demandes comment ça marche ?\r\nJe te propose cette session composée d'une série de \"démo + explication de code\" pour te donner un aperçu du potentiel de la librairie et de ses fondements.", 
        "format": "Tools-in-Action", 
        "id": "AXE-2491", 
        "speakers": [
            {
                "fullname": "Rossi Oddet", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/c267414b8df33907b95721087ad4663dd4cc0a94"
            }
        ], 
        "title": "D3js par l'exemple", 
        "track": ""
    }, 
    {
        "description": "Savoir faire du machine learning est une compétence de plus en plus recherchée de nos jours, pourtant cette discipline est loin d'être la plus simple à acquérir. Le but de cette université est donc de vous initier progressivement au machine learning en commençant par l'implémentation de quelques algorithmes basiques (Kmeans, naive Bayes) en Scala. Puis, nous utiliserons les outils plus récents des data-scientists au travers de la librairie MLlib de Apache Spark, framework reconnu dans le domaine du machine learning et du traitement de gros volume dans l'éco-système Java. Vous serez guidé par un tutoriel et des tests unitaires (en plus des animateurs) tout au long des exercices.", 
        "format": "Hand's on Labs", 
        "id": "LJF-6972", 
        "speakers": [
            {
                "fullname": "Mathieu Breton", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/daeab377e37617a89604540fb4ab70e23d81d78c"
            }, 
            {
                "fullname": "Alban Phélip", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/53b6b577754673ac2bf1b909a2b198ccda7fa7e1"
            }, 
            {
                "fullname": "Yoann Benoit", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/19215b819b8eed94a741f0958c7f86e0b4b3e118"
            }
        ], 
        "title": "Initiation au Machine Learning avec Spark", 
        "track": ""
    }, 
    {
        "description": "Développer une plate-forme pour une startup implique de concilier des contraintes opposées: livrer rapidement du code de qualité, avec une équipe limitée tout en n'insultant pas l'avenir. En tant que développeurs, il est tentant de vouloir utiliser le langage que l'on utiliser pour l'application à toutes les étapes du processus de développement. Surtout quand ce langage, Haskell, offre un niveau de sécurité à la compilation bien supérieur aux alternatives disponibles. \r\n\r\nCette présentation est donc un retour d'expérience sur notre utilisation de l'éco-système Haskell pour (presque) tous les aspects du développement de notre plate-forme: serveur et services répartis bien sûr, mais aussi système de \"build\" avec Cabal et Shake, intégration continue avec Bake, configuration de systèmes avec Propellor. Nous y exposerons sans fard les choix que nous avons faits et leurs conséquences, heureuses ou malheureuses, et pourquoi nous pensons que Haskell est appelé à se démocratiser...", 
        "format": "Tools-in-Action", 
        "id": "IOD-0638", 
        "speakers": [
            {
                "fullname": "Arnaud Bailly", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/4d5d61401ff925662135805c4c0ada87f08372d2"
            }
        ], 
        "title": "Haskell : du sol au plafond", 
        "track": ""
    }, 
    {
        "description": "Après avoir présenté rapidement le parcours chaotique d'EcmaScript 6, nous verrons ensemble les nouvelles fonctionnalités apportées par cette version : Modules, Class, Arrow Functions, Paramètres déstructurés... Nous aborderons enfin comment intégrer dès aujourd'hui ces nouveautés dans le code d'un projet via le transpileur BabelJS", 
        "format": "Conférence", 
        "id": "AVE-3614", 
        "speakers": [
            {
                "fullname": "Grégory Houllier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b57dde0a9688e26e8a6f11b4f99673a76ee3e210"
            }
        ], 
        "title": "Passez à ES6 dès aujourd'hui avec BabelJS", 
        "track": ""
    }, 
    {
        "description": "Chez Booking.com, un flux constant d'événements provient des différents systèmes et applications internes. Ces \"events\" sont des données critiques, et doivent être stockés pour être analysés en temps réel, ou bien sur du moyen et long terme. Ces données sont très peu structurées et de nature changeante, rendant difficile l'utilisation d'outils standards d'analyse.\r\n\r\nCette présentation montre comment fut construit un système de stockage complet avec analyse temps-réel, basé sur Riak.\r\n\r\nRiak est une base de donnée NoSQL distribuée hybride très robuste et rapide.\r\n\r\nLes points abordés seront: sérialisation et aggrégation des données, la configuration de Riak, les solutions pour diminuer la consommation de bande passante du cluster, l'implémentation de l'analyse temps-réel grace aux fonctions avancées de Riak: MapReduce, Secondary Indexes, commit-hooks.", 
        "format": "Conférence", 
        "id": "QSK-3510", 
        "speakers": [
            {
                "fullname": "Damien krotkine", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/6b12a2f979182a293135b1a36808502e8cad0167"
            }
        ], 
        "title": "Stockage et analyse temps réel d'événements avec Riak chez Booking.com", 
        "track": ""
    }, 
    {
        "description": "Modéliser ses données dans ElasticSearch peut paraître simple quand il s'agit de benner ses logs, mais cela se complique quand on veut y faire entrer toutes les données de son métier, issues de différents SI en prenant en compte toutes les contraintes techniques  et/ou organisationnelles d'une grosse (et ancienne) entreprise. Là, ça devient un vrai casse-tête ! ", 
        "format": "Conférence", 
        "id": "SSS-9318", 
        "speakers": [
            {
                "fullname": "Bruno Bonnin", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/deeee961f87318719698761fcc1cd3289a8bd526"
            }
        ], 
        "title": "Comment (ne pas réussir à) modéliser ses  data dans Elasticsearch", 
        "track": ""
    }, 
    {
        "description": "En 16 ans d'existence, Lucene s'est fait une place de choix dans le monde des moteurs de recherche et fait figure de pionnier dans le monde des bases de données NoSQL open-source. Conçu à l'origine pour résoudre des problèmes de recherche plein texte, Lucene est aussi une alternative de plus en plus crédible comme document store ou moteur d'analytics. Dans cette présentation je vous propose d'expliquer ce que Lucene sait faire et les grandes lignes de son fonctionnement, notamment en comparaison par rapport aux autres bases de données existentes.", 
        "format": "Conférence", 
        "id": "KZY-0431", 
        "speakers": [
            {
                "fullname": "Adrien Grand", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/d335baf10412c0d2addb7eeb41f6e742283f456a"
            }
        ], 
        "title": "Apache Lucene", 
        "track": ""
    }, 
    {
        "description": "On entend beaucoup parler en ce moment du besoin d’avoir plus de femmes dans les métiers du numérique. Mais la diversité ne s’arrête pas là.\r\n\r\nQu'est ce qu’on entend par diversité ?\r\nQu'est ce que ça peut apporter à mon équipe ?\r\nQuelles sont les bonnes pratiques ?\r\n\r\nNous tenterons de répondre à ces questions lors de cette présentation qui ne se veut pas moralisatrice, mais souhaite juste proposer des pistes de réflexions sur ce débat.", 
        "format": "Conférence", 
        "id": "TSF-4040", 
        "speakers": [
            {
                "fullname": "Cécilia Bossard", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/25ad846ddc852cf72537bced0f9aed8b9042df84"
            }, 
            {
                "fullname": "Héléna Jacob", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/d9aba1b23f72c7bfd6fa88dc7a189c583f6cb0bc"
            }
        ], 
        "title": "Et la diversité dans tout ça ?", 
        "track": ""
    }, 
    {
        "description": "Chez CloudBees nous avons muté au cours des quatre dernières années de l'état de startup décousue à celui d'un système bien rôdé. Certaines décisions techniques initiales ont été amèrement regrettées, d'autres souffrent simplement d'obsolescence. Dans les deux cas, nous avons du gérer l'évolution du système sans que l'utilisateur n'en souffre : avec une couverture mondiale, il n'y a aucune downtime possible. \r\n\r\nPour illustrer ce challenge avec quelques exemples je vais présenter la migration de l'infrastructure de build-on-demand vers une solution multi-tenant, ainsi que le passage d'une solution conçue sur mesure avec LXC à des conteneurs Docker - dans les deux cas une transition en douceur sur plusieurs mois sans que les utilisateurs n'aient à s'en soucier.\r\n", 
        "format": "Conférence", 
        "id": "LIP-2417", 
        "speakers": [
            {
                "fullname": "Nicolas De loof", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/f501a00c32061ea929c2fd75bcd36210218c7878"
            }
        ], 
        "title": "Changing the wheel of a moving car - faire évoluer l'infra sans interruption", 
        "track": ""
    }, 
    {
        "description": "Nest, Qivivo, Netatmo vous disent quelque chose ? Une dès première application des objets connectés concerne la gestion du chauffage via le thermostat d'ambiance.\r\n\r\nDans cette présentation, je parlerais du système que j'ai mis en place chez moi pour réaliser un thermostat connecté à base de :\r\n\r\n* raspberry pi\r\n* connecteur Z-Wave\r\n* [JeeNode](http://jeelabs.net/projects/hardware/wiki/JeeNode)\r\n* sondes de températures\r\n* mqtt\r\n\r\nVous obtenez alors un thermostat connecté permettant de gérer votre chauffage de n'importe où.", 
        "format": "Quickie", 
        "id": "NWS-3930", 
        "speakers": [
            {
                "fullname": "Alexandre Thomazo", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/7bfd2f2b1a9030d0532c90d301e58db2116db533"
            }
        ], 
        "title": "Thermosmart, le thermostat connecté", 
        "track": ""
    }, 
    {
        "description": "\"Mais le Test Driven Development je connais, c'est cette technique où tu écris les tests avant et tu met un temps fou avant d'écrire du vrai code ? Ils sont mignons avec leurs méthodologies modernes mais avant on n'écrivait pas de tests et ça marchait tout aussi bien, il suffit de développer sans bugs! Et puis même il parait selon certains que dans le TDD finalement les tests, c'est pas ce qu'il y a de plus intéressant !\"\r\n", 
        "format": "Quickie", 
        "id": "TZD-6114", 
        "speakers": [
            {
                "fullname": "Nicolas PERU", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/5d1d12db41e59e80952d00f33c6473432edd49a9"
            }
        ], 
        "title": "TDD: is it all about tests ?", 
        "track": ""
    }, 
    {
        "description": "Si vous n’avez pas passé les 18 derniers mois dans une hutte en Mongolie, alors vous n’avez pas d’excuses pour ne pas avoir entendu parler de Docker. Désormais, vous devriez connaître cet “outil” indispensable à tout bon développeur. Mais savez-vous quand le dégainer ? Au delà des usages de packaging, déploiement continu, \"microservices\"... Docker se révèle très efficace pour résoudre des problématiques de “workload” Nous vous proposons d’aborder Docker sous ce nouvel aspect: réaliser une architecture modulaire à base de conteneurs. Nous parlerons de “meta-conteneurs”, Docker-in-Docker...", 
        "format": "Conférence", 
        "id": "ATJ-4642", 
        "speakers": [
            {
                "fullname": "Julien Vey", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/692376e644585a27aafad9aa2274ec26f7645715"
            }, 
            {
                "fullname": "Éric Bellemon", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/9624d8599ea99dd116179ab5afd4054093564d2c"
            }
        ], 
        "title": "Microplugins avec Docker", 
        "track": ""
    }, 
    {
        "description": "Suite à une refonte, comment migrer progressivement les utilisateurs d'un site grand public vers sa nouvelle version?\r\n\r\nComment activer de manière incrémentale des fonctionnalités en production?\r\n\r\nComment développer sur une seule branche dans un contexte de continuous delivery?\r\n\r\nSi vous vous posez ces questions ou si le sujet vous intéresse, nous vous présenterons les architectures mises en place pour répondre à ces problématiques sur le portail **[pagesjaunes.fr][1]** avec un retour d'expérience sur les projets **traffic manager** et **feature flipping**.\r\n[1]:http://www.pagesjaunes.fr", 
        "format": "Conférence", 
        "id": "XBR-5060", 
        "speakers": [
            {
                "fullname": "Christophe Desmarest", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/95d908536fd4575d2a3dc7872a00e43aa572846f"
            }, 
            {
                "fullname": "Stéphane PIEL", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/9c4c32ea2922800e1e3976c6487113ff5ca56ac9"
            }
        ], 
        "title": "Déploiement incrémental chez Pages Jaunes : feature flipping et traffic manager", 
        "track": ""
    }, 
    {
        "description": "Le système d'initialisation de linux est historiquement géré par system V. En 2010, Lennart Poettering, de la société red hat, constate que celui-ci n'est plus adapté aux contraintes des environnements modernes, et décide, avec l'appui de red hat, d'en développer un nouveau : systemd.\r\n\r\nAprès un tour d'horizon de l'architecture de systemd, nous verrons, comment dev et ops peuvent l'utiliser afin de gérer le cycle de vie de leur application, ordonnancer des tâches, redémarrer automatiquement une application en cas de crash, gérér des dépendances entre processus, ...", 
        "format": "Conférence", 
        "id": "DPI-6386", 
        "speakers": [
            {
                "fullname": "Jean-Eudes Couignoux", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/c7038433933d2344191764c85b94f8d2e81b6116"
            }
        ], 
        "title": "Les développeurs aussi maîtrisent le systemd", 
        "track": ""
    }, 
    {
        "description": "Git vous parle ? \r\n\r\nEn fait ce n'était pas vraiment une question mais plutôt une double affirmation : \r\n\r\n* soit il cause avec vous de manière interractive; \r\n\r\n* soit c'est ce que vous allez vous dire à la sortie de ce TIA d'une 1/2 heure.\r\n\r\nJe vous propose à travers quelques tips and tricks de découvrir ce qui se cache vraiment derrière git en mode interractif, les rebases avancées et toute la réécriture d'histoire pour que ca devienne vos reflèxes quotidiens.\r\n\r\nAu passage, en bonus, vous allez vous réconcillier avec la ligne de commande :)\r\n", 
        "format": "Tools-in-Action", 
        "id": "QBY-7723", 
        "speakers": [
            {
                "fullname": "Haja Rambelontsalama", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/3bee18d5af001139c1a6595f63c7f1001336cea0"
            }
        ], 
        "title": "Retour vers le (passé|futur)* avec Git", 
        "track": ""
    }, 
    {
        "description": "Angular est un des blockbusters des frameworks Javascript. Pourtant, depuis l’annonce de la version 2 en octobre dernier, le doute et la préoccupation règne au sein de la communauté des développeurs : rupture de concepts, pas de rétro-compatibilité, nouveau langage... Cette révolution ne risque-t-elle pas de se terminer par un abandon ? Faut-il migrer ? Que va devenir mon projet en Angular 1 ?\r\nCette conférence vous présentera les nouveautés d’Angular 2, ainsi que l’état d’avancement du framework, … bref vous aidera à y voir plus claire.", 
        "format": "Conférence", 
        "id": "LNX-9869", 
        "speakers": [
            {
                "fullname": "Grégory Houllier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b57dde0a9688e26e8a6f11b4f99673a76ee3e210"
            }, 
            {
                "fullname": "Nicolas Pennec", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/41fc60b615b4a365b9cc83844484357ab39f3342"
            }
        ], 
        "title": "Angular 2, Le Réveil de la Force", 
        "track": ""
    }, 
    {
        "description": "Je vais essayer de vous expliquer en 50 minutes pourquoi et comment faire des tests unitaires et d'intégration dans une application Javascript. Je vous montrerai sur un exemple simple en live coding comment on peut utiliser Jasmine, Karma et Protractor.\r\n \r\nL'application qui sera prise en exemple sera une application Angular JS. Jasmine et Karma peuvent être utilisés quelque soit le framework Javascript alors que Protractor est spécifique aux applicatons Angular.\r\n\r\n", 
        "format": "Conférence", 
        "id": "EKC-0429", 
        "speakers": [
            {
                "fullname": "Guillaume Ehret", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/43a25054914813084e115374856c5a9f842c4ead"
            }
        ], 
        "title": "Tester une application Javascript", 
        "track": ""
    }, 
    {
        "description": "Plus de 10000 lignes de code à refactorer, très peu de tests unitaires, seulement 1,22% de code couvert par les tests ... Voilà le challenge auquel j'ai été récemment confronté !\r\n\r\nVoici mon retour d'expérience sur la technique \"Golden Master testing\" que j'ai utilisée pour sereinement venir à bout de ce refactoring.", 
        "format": "Quickie", 
        "id": "TYR-8750", 
        "speakers": [
            {
                "fullname": "Sébastien Prunier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/809da953e557d60714a52cbc655ea3483f43e1cb"
            }
        ], 
        "title": "Refactoring avec 1,22% de code couvert par les tests ... Golden Master testing à la rescousse !", 
        "track": ""
    }, 
    {
        "description": "Comment je suis passé d’un openspace dans une grosse boite au nom fruité  à une startup en télétravail. Et tout ce que cela implique dans les méthodes de travail.", 
        "format": "Quickie", 
        "id": "DHA-6726", 
        "speakers": [
            {
                "fullname": "Nicolas Ledez", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/e5f7b4d8c9e624414d863371969f33c60557401b"
            }
        ], 
        "title": "Travailler dans une startup la tête dans les nuages", 
        "track": ""
    }, 
    {
        "description": "Developing a mobile application is a complex process. It requires UI & UX design skills as well as great development capabilities. The process is even more difficult when the application you are building acts as a companion to an existing web application. In this talk we explain the process of creating a mobile application from the ground up using an existing web app as a starting point. We will use the Capitaine Train Android app as our main example and will explain how most of the issues were faced and solved in order to create a mobile-friendly user experience.", 
        "format": "Conférence", 
        "id": "KCI-8164", 
        "speakers": [
            {
                "fullname": "Cyril Mottier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/2e15eb74e12b2ced91aeb74046a72c2bf587d150"
            }
        ], 
        "title": "Designing Capitaine Train Mobile Experience", 
        "track": ""
    }, 
    {
        "description": "Nous savons tous qu'il est préférable de coder une application qui soit rapide à utiliser ... Mais quel effort mettre sur l'optimisation de la latence applicative ? Pourquoi Netflix a été jusqu'à créer un nouveau format (le JSONG ?!?) juste pour améliorer l'affichage des affiches de films ?\r\nVenez comprendre l'impact de latence sur l'adoption, le fonctionnement de votre cerveau et vous enrichir des dernières tendances pour améliorer la latence (de Netflix à Google, du JSON Patch à SPDY).", 
        "format": "Conférence", 
        "id": "JWD-7708", 
        "speakers": [
            {
                "fullname": "Nicolas Babel", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/0c420b457d168d907e2de6cdf807edf442169389"
            }
        ], 
        "title": "Latence applicative et API en streaming ", 
        "track": ""
    }, 
    {
        "description": "Développeur Web Front-End est devenu un métier à part entière, un poste exigeant qui demande de plus en plus d'expertise. Les technologies Web évoluent en permanence et faire de la veille devient vite chronophage.\r\n\r\nPour vous faciliter la tâche, je vous propose un tour d'horizon de 45 outils à ne pas manquer ou à surveiller en tant que développeur web en 2015 : frameworks, librairies, tests, qualité du code, automatisation, web perfs, ...\r\n\r\nLe principe de la présentation est simple : 45 minutes pour 45 outils, 1 minute par outil.\r\n\r\n", 
        "format": "Conférence", 
        "id": "YKF-0326", 
        "speakers": [
            {
                "fullname": "Nicolas Pennec", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/41fc60b615b4a365b9cc83844484357ab39f3342"
            }
        ], 
        "title": "45 outils pour doper votre front-end", 
        "track": ""
    }, 
    {
        "description": "Venez découvrir comment lancer vos builds, déployer vos applications, et même gérer vos issues rien qu'en discutant !\r\nLes méthodes \"ChatOps\" sont de plus en plus populaires avec la mise à disposition des bots de discussion tel que le Hubot de Github et l'essor des logiciels de chat room persistantes. Profitez de l'occasion pour voir comment un simple outil de communication peut briser des silos.\r\n\r\n", 
        "format": "Tools-in-Action", 
        "id": "KEC-1221", 
        "speakers": [
            {
                "fullname": "Sébastien BROUSSE", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/c5d811edb66411fd4e584a1d9e47b4dd5985d482"
            }
        ], 
        "title": "DevOps dans ton chat !", 
        "track": ""
    }, 
    {
        "description": "What attracts researchers starting from the 60s till nowadays? What is studied in university by engineers in computer science and then successfully forgotten? What is at the heart of the compilers used daily by any software developer? Parsers! From a practical point of view using a small pill of theory, this session will bring lights on questions like: if there is so many parser-generators based on formal theory, then why javac, GCC and Clang are all hand-written? And how we, insiders of the world of parsing, do this at SonarSource for languages like Java, C/C++, C#, JavaScript, Python, COBOL?", 
        "format": "Conférence", 
        "id": "WZN-5052", 
        "speakers": [
            {
                "fullname": "Evgeny Mandrikov", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/291d102cf233b65f7e55379ab26d2d19df8276fe"
            }, 
            {
                "fullname": "Nicolas PERU", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/5d1d12db41e59e80952d00f33c6473432edd49a9"
            }
        ], 
        "title": "The Art of Parsing", 
        "track": ""
    }, 
    {
        "description": "La version 9.4 de PostgreSQL a largement amélioré le support de documents JSON. Plusieurs bench ont même montré des performances impressionnantes du moteur en comparaison d'autres bases No-SQL. \r\nCette conférence permettra de présenter comment intégrer et manipuler des données semi structurées avec PostgreSQL et son driver JDBC.\r\n", 
        "format": "Conférence", 
        "id": "OJO-6750", 
        "speakers": [
            {
                "fullname": "Pierre-Alban DEWITTE", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/e352aadd96af61bb9f95f0106c37db556fe35ba9"
            }
        ], 
        "title": "Not only SQL avec PostgreSQL", 
        "track": ""
    }, 
    {
        "description": "La cryptographie il parait que c'est con et pour les autistes ! \r\nIl est tant de reparcourir les fondements de la cryptographie moderne ainsi que de la sécurité web de manière... moins conventionnel !\r\nAinsi, mettre en scènes les acteurs fétiches de la crypto \"Bob\" et \"Alice\" avec le prisme déluré du machisme pour Bob et du féminisme pour Alice, agrémenté de vitriol à la Desproges et un fond de Jean-Marie Bigard !\r\nSachez le vous en sortirez pas indemnes !", 
        "format": "Quickie", 
        "id": "RPB-2839", 
        "speakers": [
            {
                "fullname": "Sébastien Lambour", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/3ead0851d2ea4a1a93385626497d268b7d53f962"
            }, 
            {
                "fullname": "Audrey Neveu", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/9d720104445df34116c00ebf208e03404dfdb1b6"
            }
        ], 
        "title": "History of cryptography : the sod Machofeminist way", 
        "track": ""
    }, 
    {
        "description": "Marre de votre serveur d'application ? Envie d'un framework léger pour développer des web services ? Alors venez essayer Dropwizard ! \r\nDans une session de live coding nous allons développer un service REST, y ajouter des métriques pour être pote avec les Ops, le tester unitairement et déployer tout ça sans serveur d'application.", 
        "format": "Quickie", 
        "id": "KPY-0613", 
        "speakers": [
            {
                "fullname": "Ludovic Chane Won In", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/805b5f033dfcf7d22c6b5de5103e5b65d3b74b2b"
            }
        ], 
        "title": "Dropwizard en un éclair", 
        "track": ""
    }, 
    {
        "description": "Si le Prince Charmant avait connu les fonctions de hachage, il n'aurait pas été obligé de tester les pieds de tout le royaume avant de trouver Cendrillon !\r\n\r\nOn prête généralement peu d'attention à la méthode hashCode(), présente sur tous les objets Java. Pourtant, elle est fondamentale pour les performances et la cohérence des données - Java 8 en propose d'ailleurs une nouvelle implémentation plus efficace.\r\n\r\nAlors, d'où vient-elle ? A quoi sert-elle ? Comment l'implémenter efficacement ? \r\nEt surtout, le Prince Charmant aurait-il pu retrouver sa dulcinée en O(1) ?", 
        "format": "Conférence", 
        "id": "OMG-8971", 
        "speakers": [
            {
                "fullname": "Olivier Bourgain", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/dd3344790966398519493a236e2f4130afb92811"
            }, 
            {
                "fullname": "Olivier Croisier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/b462c88b3fed6718e5693cf67d530fd8ffb271a2"
            }
        ], 
        "title": "Hashons peu mais hashons bien", 
        "track": ""
    }, 
    {
        "description": "JHipster est un générateur de code permettant de créer une application Spring Boot + AngularJS en quelques minutes. Cette présentation couvrira rapidement les technologies utilisées par JHipster (Spring Boot, AngularJS, Bower, Grunt, etc...), et se focalisera sur une session de 'live coding' où nous développerons une application métier, la modifierons, et la déploierons dans le cloud.", 
        "format": "Conférence", 
        "id": "MYR-5569", 
        "speakers": [
            {
                "fullname": "Julien Dubois", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/96e503d35f86872fe830fa2bdc9905a30312215f"
            }
        ], 
        "title": "JHipster, le générateur d'applications Spring + AngularJS", 
        "track": ""
    }, 
    {
        "description": "JHipster est un générateur de code permettant de créer une application Spring Boot + AngularJS en quelques minutes. Cette présentation couvrira rapidement les technologies utilisées par JHipster (Spring Boot, AngularJS, Bower, Grunt, etc...), et se focalisera sur une session de 'live coding' où nous développerons une application métier, la modifierons, et la déploierons dans le cloud.", 
        "format": "Conférence", 
        "id": "MYR-5569", 
        "speakers": [
            {
                "fullname": "Julien Dubois", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/96e503d35f86872fe830fa2bdc9905a30312215f"
            }
        ], 
        "title": "JHipster, le générateur d'applications Spring + AngularJS", 
        "track": ""
    }, 
    {
        "description": "Cette session est l'occasion de découvrir Kafka : un broker de messages de nouvelle génération scalable, avec des performances impressionnantes, une garantie de persistance et de réplication des messages.\r\n\r\nVous verrez :\r\n\r\n- quels sont les concepts de Kafka\r\n- l'architecture de Kafka\r\n- comment faire scaler horizontalement un cluster Kafka\r\n- quels sont les compromis à faire\r\n- quelles performances attendre\r\n- dans quel écosystème BigData Kafka s'inscrit (Storm, Hadoop, HBase, ...)\r\n- mon retour d'expérience, les points d'attention, ...", 
        "format": "Conférence", 
        "id": "DOI-7300", 
        "speakers": [
            {
                "fullname": "Vladislav Pernin", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/5547233c7fb87229808421c4d1c11bbbcb9ff301"
            }
        ], 
        "title": "Broker de messages Kafka, retour d'expérience", 
        "track": ""
    }, 
    {
        "description": "L'objectif de cette présentation est de fournir une recette simple pour diagnostiquer et améliorer les performances d'une application.\r\nCette conférence sera l'opportunité de ré-expliquer certains concepts de base (percentiles, latency, points de contention, GC, ...) utiles au quotidien ou lors d'une phase de tirs de performance. Nous verrons également les outils simples et disponibles de base dans les différentes briques d'une application type (JVM, Unix, BDD, ..) et comment ils peuvent nous aider au mieux dans cette démarche.", 
        "format": "Conférence", 
        "id": "UFF-0999", 
        "speakers": [
            {
                "fullname": "Vincent Beretti", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/97f32b3772c69b7a19b605d79ab6313a144237b4"
            }
        ], 
        "title": "Performance Pudding, une recette simple et économique.", 
        "track": ""
    }, 
    {
        "description": "Databases, servers and micro-services all set up automatically on a developer machine in a matter of minutes. Testing, staging and production environments built with the click of a button. Yesterday’s dream has become today’s reality, and we at JFrog have been doing it for several years with the help of tools like Vagrant, Chef, Artifactory and Jenkins.\r\nBut can we do better? Of course we can...thanks to Docker! By breaking up our monolithic environment into interconnected containers, we can achieve a faster setup and amazing flexibility. But with this flexibility comes a list of unexpected headaches and challenges.\r\nIn this session we will talk about our experience migrating a complicated, multi-faceted dev environment from a Vagrant-Chef combo to Docker, and about the challenges and opportunities that this new setup brings.", 
        "format": "Conférence", 
        "id": "IOT-0245", 
        "speakers": [
            {
                "fullname": "Fred Simon", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/099381b9b1baa7d47ee44b93cc7113db64774c4e"
            }
        ], 
        "title": "A Saner Management for a Multi-facet Development Environment with Vagrant and Docker", 
        "track": ""
    }, 
    {
        "description": "MongoDB ? Elastic ? Ces techonologies sont elles faites pour être concurrentes ? \r\n\r\nC'est l'histoire d'une rencontre entre deux technologies. A l'occasion de cette conférence vous apprendrez comment MongoDB et Elastic peuvent se compléter, comment tirer partie du meilleur de chaque monde : \"le bon outil pour le bon usage\".\r\n\r\nEnfin, nous vous présenterons les principaux patterns d'architecture permettant d'intégrer ces deux technologies.", 
        "format": "Conférence", 
        "id": "VFQ-1867", 
        "speakers": [
            {
                "fullname": "Sébastien Prunier", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/809da953e557d60714a52cbc655ea3483f43e1cb"
            }, 
            {
                "fullname": "Chris Woodrow", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/02496209ad79f5f33926319d1ddeaba80fde9dfd"
            }
        ], 
        "title": "MongoDB et Elastic{search}, meilleurs ennemis ?", 
        "track": ""
    }, 
    {
        "description": "Deux équipes s’affronteront, celle qui gagnera le plus de lecteurs remportera le prix du meilleur magazine de l’année. Saurez-vous tirer partie à 120% de Kanban et battre vos compétiteurs ?\r\nQuel que soit votre métier, informatique ou non, venez voir les bases de la méthode Kanban faite pour modéliser facilement tout process. Découvrez en quoi la limitation de la quantité de travail en cours accélère la production. Réfléchissez sur la quantité de stock nécessaire, ainsi que sur les goulots d’étranglement.", 
        "format": "Hand's on Labs", 
        "id": "PRP-8244", 
        "speakers": [
            {
                "fullname": "Denis ROUDET", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/3da33e5a95fd622bb1a01e5a902d1c0c16f3bc87"
            }, 
            {
                "fullname": "Serge HARDY", 
                "href": "http://cfp.breizhcamp.org/api/conferences/BreizhCamp2015/speakers/d219209e4ba8b5001ac5ad0b30b4eba394cd1744"
            }
        ], 
        "title": "Kanbanzine : comment aborder Kanban de manière ludique", 
        "track": ""
    }
]
