[
    {
        "title": "De 20 000 à 4 millions d'utilisateurs",
        "cospeaker": [
            
        ],
        "id": 34,
        "track": "Cloud et BigData",
        "description": "Passer de 20 000 utilisateurs à 4 millions : c'est le challenge qui était demandé.\n\nPour ce faire, il a été nécessaire de revoir certaines parties du SI afin de pouvoir stocker en masse les données des utilisateurs mais également afin d'être capable de les traiter.\n\nCe retour d'expérience montrera comment, avec une approche et des technologies simples, il a été possible de revoir la façon de faire et comment il a été proposé de traiter le sujet.\n\nIl montrera également les pistes qui ont été étudiées et les solutions qui ont été retenues.\n\nLes différents points qui seront abordés seront : Cassandra, REST, Netty, Spring Integration, Jolokia, Metrics saupoudré d'un peu de \"Big Data\".",
        "speaker": "Khanh Tuong Maudoux",
        "format": "Conférence"
    },
    {
        "title": "Cassandra, retour vers le futur",
        "cospeaker": [
            
        ],
        "id": 39,
        "track": "Cloud et BigData",
        "description": "Depuis les 18 derniers mois, Cassandra a évolué énormément avec l'introduction de nouvelles optimisations  pour pousser encore plus loin la performance. Du côté développement, l'arrivée du language CQL3 a changé drastiquement la donne et facilité la prise en main. Désormais développer avec Cassandra est très facile même pour les débutants. Ces améliorations ont permis un décollage phénoménale de Cassandra outre Atlantique et la vague arrive maintenant chez nous.\n\n  Pendant cette conférence, nous allons passer en revue toutes ces nouveautés et zoomer sur les apports du language CQL3 avec quelques exemples concrets en démo live",
        "speaker": "DuyHai DOAN",
        "format": "Conférence"
    },
    {
        "title": "Node.js dans Microsoft Azure",
        "cospeaker": [
            "Stéphane Goudeau"
        ],
        "id": 72,
        "track": "Cloud et BigData",
        "description": "Coupler les mécanismes évènementiels nativement asynchrones du framework opensource node.hjs avec un hébergement dans IIS permet aujourd'hui d'implémenter des solutions extrêmement « scalables » sur la plateforme Windows. Si l'on ajoute à cette recette l'ingrédient Cloud, les gains n'en sont que plus nombreux : self-provisioning, élasticité, facturation à l'utilisation.... L'objectif de cette session est de présenter différents contextes d'utilisation du framework node.js dans Azure : Cloud Services PaaS, Web Site, Azure Mobiles Services",
        "speaker": "Pierre Lagarde",
        "format": "Conférence"
    },
    {
        "title": "MongoDB 2.6 : Quoi de neuf doc?",
        "cospeaker": [
            
        ],
        "id": 157,
        "track": "Cloud et BigData",
        "description": "La version 2.6 de MongoDB est sortie le 8 avril et toute fraiche. Je vous propose dans cette session de faire le tour des nouveautés. Parmi les nouveautés mises en avant et \"démontrées\" vous verrez:\n\n - Full Text Search\n - Agrégration Framework (nouveaux opérateurs, et fonctionnalités)\n - Sécurité\n - Améliorations des index et requêtes Geo\n\nNous profiterons de cette présentation pour rappeler les cas d'usages et applications utilisant MongoDB,",
        "speaker": "Tugdual Grall",
        "format": "Conférence"
    },
    {
        "title": "Du web temps réel avec SimpleWeb4J",
        "cospeaker": [
            
        ],
        "id": 16,
        "track": "Web et Mobile",
        "description": "Au travers de cette présentation full live coding, nous verrons comment utiliser EventSource (ou Server-Sent-Events) dans un framework simple tel que SimpleWeb4j pour faire du web temps réel tout en restant en Java. \n\nCette présentation sera aussi l'occasion de montrer comment le JDK8 (lambda et api collection) nous permet de simplifier grandement notre code.",
        "speaker": "yan bonnel",
        "format": "Conférence"
    },
    {
        "title": "WebRTC : Real Time Communication",
        "cospeaker": [
            
        ],
        "id": 18,
        "track": "Web et Mobile",
        "description": "Avez déjà rêvé de faire une visio avec votre grand mère, elle sur son smartphone et vous installés dans votre canapé avec votre ordinateur portable. Le problème : elle n'a pas Skype, pas de compte Google et elle ne connait pas Facetime ? Et si votre navigateur était la solution ! Vous pourrez même lui partager les photos de votre petite dernière. Vous l'aurez compris, l'objectif de cette session est de présenter ce qu'est le WebRTC et de comprendre ce qui ce cache derrière.",
        "speaker": "jean-francois garreau",
        "format": "Conférence"
    },
    {
        "title": "Live coding: Web temps réel avec Play 2",
        "cospeaker": [
            
        ],
        "id": 22,
        "track": "Web et Mobile",
        "description": "Les applications web temps réel font usage de WebSockets, Server Sent Events, Comet et d'autres protocoles pour offrir une communication permanente entre le serveur et le navigateur. De nombreux frameworks web offrent ce genre de possibilité à travers des APIs très basiques.\n\nCette présentation vous montrera comment utiliser l'API des Iteratees offerte par Play 2 pour manipuler, filtrer et fusionner à la demande des flux de données de manière réactive dans une application complète et concrète.",
        "speaker": "Mathieu ANCELIN",
        "format": "Conférence"
    },
    {
        "title": "Android bashing : apprendre des erreurs des grands",
        "cospeaker": [
            
        ],
        "id": 27,
        "track": "Web et Mobile",
        "description": "Microsoft, Facebook, Yahoo, ... Ces géants du soft sont tous de grands éditeurs d'applications et leur réputation n'est plus à faire. Il leur arrive malgré tout de ne pas rencontrer le succès sur le PlayStore Android.\n\nDurant cette conférence je vous raconterai l'histoire de ces applications qui avaient tout pour réussir et qui ont échoué à satisfaire les utilisateurs. On identifiera ensemble les erreurs commises afin de pouvoir prendre soin de ne jamais les reproduire.",
        "speaker": "Eyal LEZMY",
        "format": "Conférence"
    },
    {
        "title": "UX Design, Design thinking…? De quoi parle t-on ?",
        "cospeaker": [
            
        ],
        "id": 53,
        "track": "Web et Mobile",
        "description": "Définition et présentation de la démarche UX dans un projet. A quelles étapes du projet intervient l'UX design ? Sous quelle forme ? Avec quels outils ? Quelles méthodes ?\n\nPourquoi s'intéresse t-on (enfin !) à l'utilisateur ?\n\nMéthodes et études de cas. Le rôle de l'UX dans l'entreprise et sa conséquence sur la conduite du changement, comment vendre l'UX et qui l'achète ? Qui sont les UX Designers, ergonomes, architectes de l'information… ? \n\nToutes ces questions pour comprendre les enjeux de la démarche Design thinking, ce qu'elle révolutionne dans l'organisation et la culture des projets de l'entreprise.",
        "speaker": "Cédric Bouré",
        "format": "Conférence"
    },
    {
        "title": "HTML5 Gaming",
        "cospeaker": [
            
        ],
        "id": 62,
        "track": "Web et Mobile",
        "description": "Venez découvrir les API HTML5 ainsi que les mécanismes qui vous permettront de réaliser un jeu en 2D, sans aucune librairie !\nNous analyserons le code source d'un prototype de jeu des années 90 réécrit en HTML5 pour l'occasion.",
        "speaker": "Alan Menant",
        "format": "Conférence"
    },
    {
        "title": "Dart, it's Angular too!",
        "cospeaker": [
            
        ],
        "id": 64,
        "track": "Web et Mobile",
        "description": "AngularJS n'est désormais plus à présenter mais la vie du développeur ne se résume pas au JavaScript! De nouveaux langages prometteurs émergent et Dart est l'un d'eux: soutenu par Google, open-source, client-serveur... Il permet de faire du développement web de manière structuré en permettant aux développeurs objets de le prendre en mains en, seulement, quelques heures. Mais Dart a récemment subi un changement majeur: le portage d'Angular dans son écosystème.\n\nOn peut donc utiliser Dart avec des notions comme le 2-way binding, les filtres, les directives afin de réaliser nos single page applications avec un unique langage du serveur au navigateur. \n\nCette conférence a pour but de présenter rapidement comment, lorsque Dart rencontre Angular, le seul gagnant est le développeur.",
        "speaker": "Pierre Reliquet",
        "format": "Conférence"
    },
    {
        "title": "Créer des jeux 3D pour le web",
        "cospeaker": [
            "David Rousset"
        ],
        "id": 70,
        "track": "Web et Mobile",
        "description": "Nous verrons dans cette session comment créer des jeux HTML5 en 3D temps réel à destination du Web (IE11/Chrome/Firefox & Opera). Pour cela, nous vous présenterons un framework de jeux WebGL gratuit et open source nommée Babylon.JS. Il est créé en France et compatible multi-plateformes. Vous découvrirez comment couvrir toutes la chaine de production, de la création des assets 3d depuis Blender, son export vers Babylon, le support de différent type de caméra (touch, accéléromètre, etc.), la gestion du moteur physique et l'implémentation de la logique du jeux en JavaScript.",
        "speaker": "Pierre Lagarde",
        "format": "Conférence"
    },
    {
        "title": "Workshop: MongoDB par la pratique!",
        "cospeaker": [
            "Sébastien Prunier"
        ],
        "id": 17,
        "track": "Cloud et BigData",
        "description": "Ce workshop est l'occasion de découvrir MongoDB par la pratique en s'appuyant sur Java et/ou NodeJS. Durant ces 2h00 nous verrons les points suivants:\n\n- Installation et configuration\n- Opération CRUD\n  - Manipulation de la base\n   de données depuis le MongoShell\n  - Indexation\n- Développement d’une application\n  - Découverte des Drivers Java & Node\n  - Création d'un API REST et intégration avec AngularJS\n- Document Design\n  - Bonnes pratiques et\n   options \n- Requetes avancées : Géospatial, Full Text\n  - Recherche Géospatiale \n  - Activation et utilisation des index Full Text\n- Agrégation\n  - Analyse des données avec le MongoDB Aggregation Framework\n- Déploiement\n  - Réplication & Sharding\n\nPrérequis:\n\n- MongoDB 2.4 ou 2.6\n- Git\n- Developer Java\n  - JDK 6 ou 7\n  - Maven\n- Developer Node\n  - NodeJS",
        "speaker": "Tugdual Grall",
        "format": "Hands-on"
    },
    {
        "title": "Hands on elasticsearch and Kibana",
        "cospeaker": [
            
        ],
        "id": 52,
        "track": "Cloud et BigData",
        "description": "**Let's start to discover elasticsearch and Kibana.**\n\nFor this session, you will need:\n\n* a JVM\n* a browser\n\nWe will install elasticsearch, Kibana and Marvel and will use that tools to:\n\n* index/update/get/delete documents\n* search\n* compute\n* build dashboards to make sense of marketing data",
        "speaker": "David Pilato",
        "format": "Hands-on"
    },
    {
        "title": "Premiers pas avec Symfony",
        "cospeaker": [
            
        ],
        "id": 109,
        "track": "Web et Mobile",
        "description": "Utilisé par de grandes entreprises, Symfony 2 est un outil de développement PHP fiable, pour réaliser des applications web robustes et évolutives.\n\nCette présentation de Symfony 2 qui associe théorie et exercices pratiques, vous permettra d’appréhender l'architecture du framework, de connaître les différents outils disponibles et ses principales fonctionnalités telles que l'architecture MVC, la création des formulaires, la sécurité, l'interfaçage avec une base de données et les services.",
        "speaker": "Tony Dubreil",
        "format": "Hands-on"
    },
    {
        "title": "Pourquoi versionner ses données en noSQL",
        "cospeaker": [
            
        ],
        "id": 137,
        "track": "Cloud et BigData",
        "description": "Lorsque l'on traite des données documentaires avec couchbase, riak ou mongo, on est souvent tenté de modifier le modèle de données durant la vie du projet.\nCe talk a pour but d'expliquer comment versionner une données noSQL et le gérer dans votre code.",
        "speaker": "Quentin ADAM",
        "format": "quickie"
    },
    {
        "title": "Les Sensors et le HTML5  (TIA)",
        "cospeaker": [
            
        ],
        "id": 20,
        "track": "Web et Mobile",
        "description": "Html5 nous donne accès à un certain nombre de capteurs / périphériques qu’auparavant on pouvait seulement utiliser par le biais de plugins. Nous allons jouer avec nos téléphones / nos ordinateurs pour découvrir comment interpréter des éléments tels que l'orientation du téléphone, la captation de la voix, la création de sons, la caméra...\n\nCet atelier montrera comment implémenter chacune de ces fonctionnalités. Au programme : giroscope / microphone / usermedia / vibration ...\n\nBase en Javascript requises. NodeJS doit être installé aussi ! Et enfin, il vous faut un smartphone",
        "speaker": "jean-francois garreau",
        "format": "quickie"
    },
    {
        "title": "Libérez la puissance de Couchbase",
        "cospeaker": [
            
        ],
        "id": 23,
        "track": "Cloud et BigData",
        "description": "Cette présentation sera l’occasion de voir comment utiliser au mieux Couchbase depuis une application Scala ou Java tout en bénéficiant d’une intégration poussée avec la surpuissante API JSON de Play 2, son API asynchrone non bloquante et les Futures Scala, ainsi que des nombreux goodies fournis par le framework depuis Java ou Scala. Cette présentation montrera comment rapidement créer une application CRUD basique fournissant une API RESTful avec AngularJS puis comment aller plus loin en utilisant ReactiveCouchbase et ses nombreuses astuces pour améliorer la productivité du développeur.",
        "speaker": "Mathieu ANCELIN",
        "format": "Tools in Action"
    },
    {
        "title": "5 ingrédients pour pimenter Elasticsearch",
        "cospeaker": [
            
        ],
        "id": 118,
        "track": "Cloud et BigData",
        "description": "Elasticsearch est un moteur de recherche très facile à utiliser.  Il n’y a qu’à télécharger, dézipper, lancer, indexer pour rechercher. Pourtant, il cache quelques des pièges à éviter pour que l’expérience ne tourne au vinaigre.\nJérôme vous présentera quelques ingrédients et recettes sympas pour pimenter vos réalisations en quelques tours de mains. Venez et dégustez sans modération !",
        "speaker": "Jérôme Mainaud",
        "format": "Tools in Action"
    },
    {
        "title": "Ionic In Action",
        "cospeaker": [
            
        ],
        "id": 85,
        "track": "Web et Mobile",
        "description": "Ionic est un framework permettant de construire des applications mobiles hybrides avec HTML5. Il propose un modèle de programmation reposant sur des briques technologiques existantes (AngularJS, Sass, etc.).\n\nCette session vous propose en 30 min une présentation de Ionic et une démonstration.",
        "speaker": "Rossi ODDET",
        "format": "Tools in Action"
    },
    {
        "title": "Mutualiser du code natif multiplateforme",
        "cospeaker": [
            
        ],
        "id": 146,
        "track": "Web et Mobile",
        "description": "Lorsque l'on vise plusieurs plateformes, à commencer par iOS et Android, il y a plusieurs approches.\n\nParfois on voit une seule équipe qui fait une application entièrement générique (en général HTML5) avec les parties communes des plateformes, et qui l'encapsule pour la diffuser sur toutes les marketplace à l'identique, mais aujourd'hui les utilisateurs s'attendent à avoir des applications bien plus intégrés à leur plateforme que cela.\n\nSouvent on voit des équipes différentes spécialisées sur chacune des plateformes, qui profite en natif de toute la richesse de chaque plateforme, mais sans partager leurs connaissances, avec des fonctionnalités pas toujours identiques et un backend à faire évoluer en commun quand même, et du temps à passer pour redévelopper la même chose sur chaque plate-forme avec des librairies tierces différentes à chaque fois.\n\nNous vous proposons une autre approche : Xamarin. L'idée est de développer des applications réellement native. On code les parties spécifiques pour chaque plateforme en tirant toute leur richesse : on a un accès direct à l'intégralité des API spécifiques (en particuliers pour les vues). On peut par contre réutiliser tout le reste entre toutes les plateformes, autour d'un langage commun : C#, qui n'effraiera pas les développeurs Java. Plus besoin de recoder le code métier ou la connexion back-end 3 fois. On peut s'attendre à 70% de réutilisation de code en commun. Et l'équipe n'est plus en silo, c'est bien plus simple de travailler en équipe, dans un objectif commun.",
        "speaker": "Guillaume Collic",
        "format": "Conférence"
    },
    {
        "title": "RxJava + Java8 pour sortir de l'enfer des Callback",
        "cospeaker": [
            
        ],
        "id": 58,
        "track": "Functional",
        "description": "Callback de callback de callback de callback... Déjà rencontré une telle situation, qui vous ferais perdre votre amour immodéré des tabulations (ou des n-espaces, on est pas sectaires)?\n\nAu cours de cette session nous présenterons la librairie de programmation asynchrone **RxJava** : concepts de la programmation réactive, comparaison avec d'autres solutions pour de l'asynchrone, aperçu de l'API.\n\nNous verrons ensuite comment celle-ci, combinée aux **Lambdas** de Java 8, pourrait nous faire voir la lumière lorsque l'on est coincé au coeur de *l'Enfer Des Callbacks*...",
        "speaker": "Simon BASLE",
        "format": "Conférence"
    },
    {
        "title": "Programmation fonctionnelle avec Groovy",
        "cospeaker": [
            
        ],
        "id": 79,
        "track": "Functional",
        "description": "Et oui, Groovy sait aussi faire du fonctionnel !\n\nAu menu, en entrée, les closures : faites de la récursion, composez-les, mémoiser-les, currifiez-les, faites en des high-order functions, et plus encore. \n\nEn plat de résistance, on mapera, filterra et on réduira des collections.\n\nEn dessert, parlons d'immutabilité, de laziness, et même de concurrence et de collections persistentes.\n\nTous les ingrédients pour faitre votre tambouille fonctionnelle !",
        "speaker": "Guillaume Laforge",
        "format": "Conférence"
    },
    {
        "title": "We Are Family",
        "cospeaker": [
            
        ],
        "id": 35,
        "track": "Agilité",
        "description": "The traditional way of running a company has been documented by people from Harvard Business School and many other reputable institutions. If you do it differently you are considered to be in uncharted territory. I've started to notice that the new approaches companies like GitHub are taking to running a business are influenced a lot from the way families and family businesses are run.\n\nBecoming close with your coworkers and treating them like family helps foster innovation and creates an amazing culture where a variety of people can feel comfortable and enjoy themselves. Family members are honest with each other. Sometimes when someone critics you it can hurt, but when you know that it is backed with great respect and love you use it to help you become better.\n\nHaving a great idea, creating useful products, and writing stellar code can be done by smart people. The difficult part is figuring out how to get tons of smart people to work well together. The social aspect is hard, but when you build a culture based off of values that are important to a family you'll see the amazing things that can be done.",
        "speaker": "Danish Khan",
        "format": "Conférence"
    },
    {
        "title": "Trois bonnes raisons de travailler avec agilité",
        "cospeaker": [
            
        ],
        "id": 81,
        "track": "Agilité",
        "description": "Le monde du développement de logiciel nous offre un cadre unique où le meilleur et le pire sont possible.\nChacun des acteurs d'un projet seront d'accord pour partager un même diagnostique : *\"Le problème vient des autres\"*\n\n - L'équipe est ultra compétente et ne fais que ce qui lui plait...\n - Le marketing a des idées innovantes et n'écoute pas les solutions proposées par l'équipe... \n - L'organisation, les processus sont bien rodés et nos produit n'arrivent pas a atteindre leur cible ...\n\nCe constat d'échec, a amener un groupe d'experts du développement de logiciel a rédiger le manifeste agile. Depuis la mouvance agile essaie de *permettre aux Hommes impliqués dans la réalisation d'apprendre avant de parvenir au succès.*\n\nJe vous propose d'échanger sur ce thème autour de :\n\n - Travailler en équipe\n - Organisation et communication\n - Faire émerger le bon produit\n \nCar l'agilité est l'affaire de tous et que nous développeur, nous pouvons adopter la bonne posture,\nensemble, nous essaierons d'identifier les leviers d'actions qui nous permettrons d'atteindre dans votre contexte le bon équilibre entre : Compétence - Organisation - Idée",
        "speaker": "Julien Fallet",
        "format": "Conférence"
    },
    {
        "title": "Des petits pas vers le Continuous Delivery",
        "cospeaker": [
            
        ],
        "id": 83,
        "track": "Agilité",
        "description": "LesFurets.com est passé en 18 mois d'une organisation solide de type \"éditeur logiciel\" avec une release par mois à une organisation non moins solide en \"Continuous Delivery\" avec une mise en production par jour de \"ce qui est prêt\" (sans être bloqué par les développements en cours).\n\nC'est un développeur qui vous présentera l'histoire vécue de l'intérieur : << Ce changement nous pousse à devenir de meilleurs développeurs, car avant de livrer tous les jours, il y a des étapes intermédiaires nécessaires pour faire naître le besoin et développer la capacité de l’équipe à changer. >>\n\nUn bon produit ne sort pas du chapeau, il se construit par itération, en essayant, en se trompant et en corrigeant. Raccourcir la boucle de retour entre les concepteurs et les utilisateurs apporte une très grande valeur compétitive. Adoptez le continuous delivery pour devenir l’équipe IT dont le business rêve.\n\nLe vouloir n’est pas tout, il reste à savoir comment s’y prendre. Le modèle itératif de SCRUM atteint ses limites lorsque l’on vise à mettre en prod plus souvent (Time to Market aggressif). Les coûts de recette explosent et la synchronisation des tâches se complique.\n\nChez LesFurets.com nous avons entièrement changé notre gestion de projet et nos méthodes de développement. Le fonctionnement adhère fortement à une philosophie où le planning de release et deadlines n’existent plus, les développements sont livrés simplement quand ils sont prêts (Flux).\n\nLa présentation passera en revue tous les moyens techniques et organisationnels que nous employons pour garantir le même niveau de qualité qu’auparavant : mise en production, livraison de code, validation, intégration continue, travail en feature branches, itération avec le business, spécifications fonctionnels.\n\nTechniquement nous présenterons notre Usine Logicielle, le poste et les actions du développeur, et l'organisation de la QA.",
        "speaker": "Pflieger Arnaud",
        "format": "Conférence"
    },
    {
        "title": "Continuous Delivery chez Capitaine Train",
        "cospeaker": [
            
        ],
        "id": 88,
        "track": "Agilité",
        "description": "Je souhaite vous montrer comment nous sommes passé de livraisons rares et douloureuses à des livraisons banales et fréquentes. Livrer son logiciel en production c'est un chemin parsemé d'embûches, donc il sera souvent question de ce qui ne marche pas ! Etre agile c'est aussi apprendre de ses erreurs, et vous verrez que si nous avons des choses à dire, c'est que nous avons beaucoup appris !\n\nOn parlera de technique, de discipline de groupe et beaucoup de solidarité. On parlera de gestion des priorités, des contraintes externes comme les fixes de sécurité ou les montées de versions de services tiers.\nLivrer tous les jours c'est possible et c'est même assez banal !",
        "speaker": "Frédéric Menou",
        "format": "Conférence"
    },
    {
        "title": "Faire agile c'est bien, être agile c'est mieux, vivre agile c'est...",
        "cospeaker": [
            
        ],
        "id": 144,
        "track": "Agilité",
        "description": "L'agilité nous la pratiquons quotidiennement au travail. Rentrer à la maison et ne plus être agile nous parait inconcevable. Du coup, venez découvrir la richesse agile qui fourmille chez nous et que nous ré-introduisons dans notre quotidien professionnel.\n\nJe vous propose cette session parce que les valeurs de l'agilité ne concernent pas que le travail au quotidien, venez partager avec nous votre \"Agile Way of Life\"!\n\nA travers les pratiques et autres expériences personnelles que nous mettons en oeuvre au quotidien, nous vous proposons de vous faire découvrir ce que l'agilité peut nous apporter dans la gestion du quotidien. \nDe la recherche d'un emploi à la l’éducation de nos enfants, de la tentative de perte de poids à l'organisation de réunion de famille, nous vous montrerons comment peuvent se transposer de bonnes pratiques issues de l'agilité à votre contexte personnel. \nNous verrons avec vous et vos propres expériences si nous sommes atteints ou si nous sommes une communauté de personnes qui vivent l'agilité\n\nAu final, notre but est de partager et enrichir vos/nos pratiques et éventuellement le faire déborder sur le monde professionnel ! un réel paradoxe !",
        "speaker": "Aurélien Morvant",
        "format": "Conférence"
    },
    {
        "title": "Developpez en mode kick-ass",
        "cospeaker": [
            
        ],
        "id": 163,
        "track": "Agilité",
        "description": "Développer en mode Kick-Ass permet de vraiment faire les choses.\n\nDans cette présentation je vous montrerai comment: - nous utilisons les Pull Requests pour la qualité du code - collaborer rapidement pour développer vos idées - éviter les meetings pour être productif - raccourcir les boucles de retour pour échouer plus rapidement - raccourcir vos cycles de livraison - et travailler ensemble à travers différents continents.\n\nCela peut fonctionner aussi dans votre entreprise.",
        "speaker": "Nicolas De Loof",
        "format": "Conférence"
    },
    {
        "title": "Demarrer avec Docker",
        "cospeaker": [
            
        ],
        "id": 48,
        "track": "DevOps",
        "description": "Docker est un moteur de déploiement d'application sous la forme de conteneur autonome, virtualisé et portable. Ces conteneurs peuvent ensuite s'installer sur une machine physique, des VMs ou sur le Cloud par exemple. Docker est un nouvel outil, encore jeune mais offrant déjà des fonctionnalités intéressantes, que ce soit pour le développement que la mise en production.Quelques avantages :\n\n- léger, on peut lancer plusieurs conteneurs pour une charge machine inférieure àune seule VM VirtualBox\n- disposant d'un index public, la récupération d'une image est simplissime\n- le commit permet de sauvegarder l'état complet d'un conteneur pour sauvegarde et ré-utilisation \n\nCette session mélange théorie et exercice de manipulation, il vous faut donc un VirtualBox fonctionnel sur votre machine.",
        "speaker": "Sebastien Douche",
        "format": "Conférence"
    },
    {
        "title": "Vers des infrastructures agiles",
        "cospeaker": [
            
        ],
        "id": 54,
        "track": "DevOps",
        "description": "Après avoir fait ses preuves dans le monde du développement, l'agilité s'invite dans le monde de l'infrastructure.\n\nLors de cette conférence, vous décourirez comment, en s'appuyant notamment sur les concepts tels qu'Infrastructure as Code et Software Defined Datacenter, il est possible de gérer ses plateformes et environnements avec flexibilité\".",
        "speaker": "Sylvain REVEREAULT",
        "format": "Conférence"
    },
    {
        "title": "Développeurs, venez jouer avec les pratiques XP !",
        "cospeaker": [
            "Julien Balas"
        ],
        "id": 26,
        "track": "Agilité",
        "description": "L'Extreme Programming (XP) est une méthode de développement de projet dont le but principal est de réduire le coût des changements.\n\nXP s'appuie sur le respect de quatre valeurs essentielles ainsi que sur treize pratiques (intégration continue, binômage, TDD, ...).\nVenez découvrir quelques-unes de ces pratiques au travers de petits jeux qui mettront en lumière l'intérêt de leur mise en place dans les projets au quotidien.",
        "speaker": "Cécilia Bossard",
        "format": "Hands-on"
    },
    {
        "title": "Démarrer avec SaltStack",
        "cospeaker": [
            
        ],
        "id": 47,
        "track": "DevOps",
        "description": "Si Puppet ou Chef viennent rapidement à l'esprit, j'ai trouvé ces outils trop compliqués. J'ai donc testé SaltStack et fut rapidement séduit. A la fois shell distribué et outil de gestion de configuration, il est simple d'usage, puissant et rapide. J'ai ainsi rapidement automatisé mon infrastructure.\n\nCette session couvre les fonctionnalités majeures avant de passer à de la manipulation. Il faut donc disposer d'une VirtualBox fonctionnel.",
        "speaker": "Sebastien Douche",
        "format": "Hands-on"
    },
    {
        "title": "Yeoman, génère moi un générateur",
        "cospeaker": [
            
        ],
        "id": 160,
        "track": "Web et Mobile",
        "description": "Yeoman est un ensemble d'outils destinés aux développeurs front. Cet ensemble intègre une commande \"Yo\" dont le rôle est de démarrer un projet web en un instant en générant une arborescence complète, destinée à l'équipe de dev.\n\nDans ce quickie nous allons voir comment créer et personnaliser son propre générateur pour Yeoman.",
        "speaker": "Wassim Chegham",
        "format": "quickie"
    },
    {
        "title": "Développer en Java et en Caleçon",
        "cospeaker": [
            
        ],
        "id": 55,
        "track": "Agilité",
        "description": "CloudBees est une société totalement distribuée. Depuis une douzaine de pays et de timezones, l'équipe collabore en pur télétravail. \nComment organiser le boulot dans une structure aussi hétéroclite ? Quid de l'agilité dans un tel contexte ? Faut-il regretter le stand-up matinal au milieu de l'open-space ?\n\nRetour d'expérience après 3 ans de télétravail pour une société atypique.",
        "speaker": "Nicolas De Loof",
        "format": "quickie"
    },
    {
        "title": "Dur d'être à son compte : mythe && réalité",
        "cospeaker": [
            
        ],
        "id": 140,
        "track": "Agilité",
        "description": "Être à son compte, c'est pas si compliqué que ça.<br/>\nÊtre à son compte, c'est pas si simple que ça.<br/>\nQue vous soyez salarié, patron, ou indépendant, que vous ayez des questions ou des réponses, parlons en !\n\nAprès quelques années en société de service, je suis devenu l'unique salarié d'un indépendant, j'ai ensuite pris mon propre envol : d'abord en tant qu'auto-entrepreneur, suivi d'une création d'EURL, en effectuant une transition entre les 2 par du portage salarial. On m'a dit qu'un retour d'expérience serait bienvenu, le voici ;-)",
        "speaker": "Guillaume Collic",
        "format": "quickie"
    },
    {
        "title": "Behat : Automatisation des tests fonctionnels",
        "cospeaker": [
            "Tony Dubreil"
        ],
        "id": 113,
        "track": "Web et Mobile",
        "description": "**Behat** ([site officiel][1]) est un produit openSource permettant de piloter l’exécution de plans de tests fonctionnels. Interfacé avec **Selenium** ([site officiel][2]) il permet notamment l’exécution de tests dans de vrais navigateurs.\n\nCette présentation abordera les points suivants :\n\n 1. Présentation d’une architecture complète mettant en jeu Behat et\n    Selenium, \n 2. Premier pas et démo, \n 3. Tips&Tricks, CI : Intégration dans Jenkins, \n 4. Et le futur ? Démonstration du tasperbot, robot physique de test sur mobile.\n \nFort d’une expérience de plus d’un an sur l’utilisation industrielle de Behat, cette présentation résumera l’expérience acquise par Niji sur le produit Behat. Nous en profiterons également pour présenter le robot **tapsterbot** ([site officiel][3]), dernière acquisition de Niji et solution prometteuse pour tester physiquement sur devices mobiles.\n\n  [1]: http://behat.org/\n  [2]: http://docs.seleniumhq.org/\n  [3]: https://www.tindie.com/products/hugs/tapster/",
        "speaker": "Joel Seguillon",
        "format": "Tools in Action"
    },
    {
        "title": "AngularJS à 60fps",
        "cospeaker": [
            "Wassim Chegham"
        ],
        "id": 142,
        "track": "Web et Mobile",
        "description": "Ce tools in action présente en 4 parties les problématiques et leurs solutions dans le cadre du développement d'une SPA avec le framework AngularJS.\n\nLa plupart des points évoqués seront agrémentés de cas pratiques.\n\nLe plan sera le suivant : \n\n - les problémes de performances courants en SPA\n - les conseils de base\n - diagnostiquer des problèmes de performances\n - améliorer les performances de votre SPA avec AngularJS\n\nDes directives en passant par la boucle d'éxécution d'AngularJS ou le $watch, nous verrons comment il est facile de créer des problèmes de performances lorsque votre application consomme un grand nombre de données, ou que les subtilités du framework ne sont pas bien mises en pratique.\n\nMise en cache des templates, lazy-loading, ng-if vs ng-show, mono-binding seront parmi les pistes et solutions évoquées lors de ce tools in action.",
        "speaker": "Vincent Ogloblinsky",
        "format": "Tools in Action"
    },
    {
        "title": "Y sont pas cher mes tests !",
        "cospeaker": [
            
        ],
        "id": 94,
        "track": "Agilité",
        "description": "C'est marrant tout, le monde est convaincu que les tests apportent beaucoup. Mais une fois le projet à livrer, les tests deviennent moins importants.\n\nEffectivement pour 55 lignes de codes, j'ai 150 lignes de tests.\n\nSauf que votre méthode de calcul n'est pas la bonne.\n\nVenez m'écouter et à la fin de la session, vous serez convaincu de passer au TDD.\n\nÀ vous les joies du code maitrisé !",
        "speaker": "Nicolas Ledez",
        "format": "Tools in Action"
    },
    {
        "title": "Initiation à PowerShell",
        "cospeaker": [
            
        ],
        "id": 25,
        "track": "DevOps",
        "description": "Toi, oui toi qui utilises encore des GOTO dans tes scripts .bat.\nToi qui fais encore du vbs pour appeller des objets COM.\nToi qui penses que Windows c'est uniquement des UI.\nEt même toi, qui fait du shell sur tes serveurs linux, si tu veux voir un peu son cousin chez Microsoft.\n\nEt bien, cette session est pour toi !\n\nAu programme des démos, encore des démos et que des démos !",
        "speaker": "Fabien Dibot",
        "format": "Tools in Action"
    },
    {
        "title": "Trend it",
        "cospeaker": [
            
        ],
        "id": 67,
        "track": "DevOps",
        "description": "Vous êtes surpris par les retour d'utilisateurs mécontents de la lenteur de votre application?\n\nVous ignorez quelle version a introduit cette nouvelle fuite mémoire?\n\nLe copier-coller de données sous Excel pour créer des graphs ou la complexité des templates [Cacti][1] vous insupporte?\n\nLe product owner vous demande sans cesse de nouveaux graphs pour illustrer ses présentations?\n\n[Graphite][2] est la solution à vos problèmes. Je vais présenter durant ce talk cet outil de monitoring temps réel ainsi que les moyens de créer les graphiques dont vous avez besoin pour monitorer votre production.\n\n\n  [1]: http://www.cacti.net/\n  [2]: http://graphite.wikidot.com/",
        "speaker": "Philippe Mioulet",
        "format": "Conférence"
    },
    {
        "title": "Le monitoring à l'heure de DevOps et BigData",
        "cospeaker": [
            
        ],
        "id": 89,
        "track": "DevOps",
        "description": "Le monitoring d'applications ... pas vraiment hype comme sujet. Et pourtant c'est un domaine en mutation parce que le déploiement continu et la démarche DevOps modifient les échanges d'informations avec la production et aussi parce qu'il est maintenant possible stocker massivement les informations collectées. Je vous propose d'explorer ces sujets autour de quelques exemples.",
        "speaker": "Claude Falguiere",
        "format": "Conférence"
    },
    {
        "title": "Développeur Entreprise, dessine moi un Linux",
        "cospeaker": [
            
        ],
        "id": 123,
        "track": "DevOps",
        "description": "Le développeur entreprise a mauvaise réputation. Dans les univers javajideuzeu ou spring, on lui reproche souvent une sur-enchère de méta-abstractions et d'imbrications de conteneurs à un niveau auquel même les scénaristes d'Inception n'ont pas osé aller. Tout ça pour des CRUD dira-t-on.\n\nAlors, peut-il contribuer à une distribution GNU/Linux ? Réponse courte : oui. Pour le reste, je vous expliquerai comment je contribue à Fedora, et ce que ça m'apporte. Je parlerai également de l'écosystème Java, en prenant pour exemple Gradle et les défis liés aux contraintes fortes que s'impose Fedora.",
        "speaker": "Dridi Boukelmoune",
        "format": "Conférence"
    },
    {
        "title": "Qu'est-ce qui rends Groovy \"groovy\" ?",
        "cospeaker": [
            
        ],
        "id": 78,
        "track": "Langages",
        "description": "Groovy n'est pas un nouveau venu parmi les langages alternatifs avec ses 3 millions de téléchargements par an. En quoi est-il un excellent choix pour vos projets ?\n\n- courbe d'apprentissage plate\n- intégration transparente avec Java\n- syntaxe concise, parfaite pour les DSL\n- approche originale du typage\n- riche écosystème : Grails, Gradle, Spock, Geb\n\nNous verrons ensemble quand et où vous pouvez l'utiliser et comment en tirer parti pour améliorer votre productivité.",
        "speaker": "Guillaume Laforge",
        "format": "Conférence"
    },
    {
        "title": "DevOps Mindstorms",
        "cospeaker": [
            "Aurélien Morvant",
            "Sylvain REVEREAULT"
        ],
        "id": 116,
        "track": "DevOps",
        "description": "Pas encore convaincu de passer aux bonnes pratiques DevOps ?\n\nEt tu aimes les Legos ?\n\nViens donc jouer avec nous dans ce serious game. Et tu va vraiment comprendre les intérêts de te t'intéresser à toute cette planète DevOps.",
        "speaker": "Nicolas Ledez",
        "format": "Hands-on"
    },
    {
        "title": "NodeSchool : workshops NodeJS en self-service",
        "cospeaker": [
            "Laurent HUET"
        ],
        "id": 24,
        "track": "Langages",
        "description": "Nous vous proposons de suivre un workshop convivial [NodeSchool](http://nodeschool.io/) pour faire du JavaScript côté serveur avec NodeJS. Vous pourrez choisir entre le workshop d'introduction ou celui plus avancé. Vous avancerez à votre rythme, avec les autres participants pour s'entraider et une équipe d'Helper.\n\nVenir avec Node installé est un plus, mais pas obligatoire. Nous aurons des installs à disposition.",
        "speaker": "Guillaume Collic",
        "format": "Hands-on"
    },
    {
        "title": "JavaFX2, un tour d'horizon",
        "cospeaker": [
            
        ],
        "id": 59,
        "track": "Tooling",
        "description": "Je vous propose d'embarquer pour un petit tour d'horizon de la technologie JavaFX 2 (ou 8, pour ceux qui aiment les developers preview), le successeur de Swing.\n\nDécoration en css, spécification des ihm en xml, animations et effets graphiques, accélération matérielle, rendu web (WebKit), bindings, mais aussi impression, support multimédia (y compris l'enregistrement), support du multitouch... Il y en a sous le capot!\n\nAlors venez vous laisser convaincre que l'on peut retrouver du fun dans la création d'ihm riches et attrayantes en Java :)",
        "speaker": "Simon BASLE",
        "format": "quickie"
    },
    {
        "title": "Présentation de la Plateforme de RA ORA-1",
        "cospeaker": [
            
        ],
        "id": 100,
        "track": "Tooling",
        "description": "The ORA-1 is a best in class hands free wireless see-through wearable display platform in the form of digital eyewear allowing hands-free mobile computing applications. It is based on Optinvent's patented Clear-Vu display engine. ORA-1 will enable many yet unimagined \"always-on\" hands free mobile applications including geo-localization (GPS), sports, messaging, situation awareness, and more. It can be connected via a standard wi-fi connection to a smartphone or tablet and will act as a hands-free wearable computer.\n\nOptinvent's ORA-1 is the most viable product to achieve widespread industry and consumer acceptance for AR glasses based on its bright, see-through, large field of view display with true seethrough capability. Furthermore, the display has a patented \"Flip-Vu\" feature which can position the virtual image in full augmented reality mode (directly in the user's line of sight), and a dashboard mode (below the user's line of sight). Along with the patented display engine, the ORA-1 includes a WiFi and Bluetooth connectivity, front facing camera, 9 axis motion sensor, ambient light sensor, microphone, loudspeaker, and a high capacity rechargeable battery.\n\nOptinvent's ORA-1 is a standalone Android based device.",
        "speaker": "Valentin de Montis",
        "format": "quickie"
    },
    {
        "title": "Une fille dans mon équipe ?",
        "cospeaker": [
            "jean-francois garreau"
        ],
        "id": 121,
        "track": "Tooling",
        "description": "Actuellement, 20% des postes dans le domaine de l’IT sont occupés par des femmes, et la tendance ne va pas en s'arrangeant. Pourquoi ce désintérêt ? <br/>\nLe groupe Women In Technology vous propose de revenir sur ce sujet et de présenter son approche pour essayer d’inverser la tendance.",
        "speaker": "Cécilia Bossard",
        "format": "quickie"
    },
    {
        "title": "Stressez votre serveur avec Gatling",
        "cospeaker": [
            
        ],
        "id": 139,
        "track": "Tooling",
        "description": "Ambitionnant de remplacer JMeter, Gatling est un outil de test de montée en charge qui utilise les dernières innovations en matière de parallèlisation et d'asynchronisme. Nous aborderons les différents concepts se cachant derrière Gatling et etudieront son langage dédié pour la création des scénarii, avant de se lancer dans la prise en main (simple) de ce bel outil.",
        "speaker": "Sebastien Quioc",
        "format": "quickie"
    },
    {
        "title": "Java 8 - Les interfaces fonctionnelles",
        "cospeaker": [
            
        ],
        "id": 44,
        "track": "Langages",
        "description": "Java 8 introduit la notion d'\"interface fonctionnelle\". Derrière ce terme obscure se cache un mécanisme qui permet de passer des références sur méthodes et des lambdas en paramètre. Et ce, en toute transparence pour le code appelé.\n\nPas à pas, nous découvrirons comment utiliser cette nouveauté du langage qui permet d'introduire du code fonctionnel dans notre code Java !",
        "speaker": "Alexis Seigneurin",
        "format": "quickie"
    },
    {
        "title": "RAML",
        "cospeaker": [
            
        ],
        "id": 152,
        "track": "Langages",
        "description": "RAML est un langage de modélisation d'API REST (ressources REST, verbes HTTP, représentations des données, etc). \n\nAutour de ce langage (indépendant de toute implémentation REST), un écosystème d'outils permettant de booster la productivité des développeurs d'API REST (éditeurs, outils de test, générateur de code) est en train d'émerger.\n\nL'objectif de ce quickie, est de présenter rapidement ce langage ainsi que certains éléments de cet écosystème.\n\nPour commencer, nous modéliserons une API REST simple (gestion de personnages) en utilisant l'éditeur en ligne API Designer.\n\nPuis nous générerons le squelette des services REST modélisés (Spec Java EE JAX-RS) en utilisant le générateur JAX-RS Codegen. \n\nPour terminer, nous utiliserons l'éditeur pour tester les services implémentés.",
        "speaker": "Mehdi Elkouhen",
        "format": "quickie"
    },
    {
        "title": "Centralisez vos logs avec logstash",
        "cospeaker": [
            
        ],
        "id": 108,
        "track": "DevOps",
        "description": "Vous en avez marre de vous connecter sur tous les serveurs en ssh pour consulter vos logs, voir pire vous devez faire un ticket à l'exploit à chaque problème pour obtenir les traces.\nLorsque vous récupérez le fichier de log sur votre machine, votre éditeur de texte ne peut pas l'ouvrir car il est trop gros. \n\nUne solution simple est d'utiliser logstash. Logstash offre une stack souple pour collecter, transformer, filtrer, centraliser, indexer et visualiser vos logs. \nCette séance présentera les concepts de ce produits à travers des exemples.",
        "speaker": "Alexandre Delègue",
        "format": "Tools in Action"
    },
    {
        "title": "Soyez Productifs ! \"I MEAN it !\"",
        "cospeaker": [
            
        ],
        "id": 32,
        "track": "Tooling",
        "description": "Le but de MEAN ( http://mean.io ) est de fournir aux développeurs use solution pour rapidement développer des applications Web en s'appuyant sur les solutions suivante:\n\n - MongoDB pour la persistence \n - NodeJS et Express pour la partie serveur (REST, oAuth, ...) \n - AngularJS pour la partie IHM\n\nCette session sera également l'occasion de présenter les quelques librairies très utilisées par les développeurs Nodes notamment Express, Mongoose, Passport",
        "speaker": "Tugdual Grall",
        "format": "Tools in Action"
    },
    {
        "title": "Vagrant pour les développeurs",
        "cospeaker": [
            
        ],
        "id": 75,
        "track": "Tooling",
        "description": "En tant que développeurs, nous travaillons souvent sur des environnements de développement dont les caractéristiques diffèrent plus ou moins de ce que l'on peut retrouver ensuite en production. Utiliser des machines virtuelles, pourquoi pas, mais c'est souvent peu pratique.\n\nDans cette session, nous verrons comment Vagrant va nous aider pour reproduire des environnements de prod sur nos postes de développement. Nous étudierons tous les mécanismes de base de l'outil : le provisioning, le mode multi-machines, la configuration réseau, les répertoires partagés. Nous n'aurons plus d'excuses pour ne pas livrer du code qui marche en prod !",
        "speaker": "Alexis Seigneurin",
        "format": "Tools in Action"
    },
    {
        "title": "Le Multi-Langage dans SonarQube",
        "cospeaker": [
            
        ],
        "id": 136,
        "track": "Tooling",
        "description": "Avec la version 4.2 de SonarQube, le ticket le plus voté par la communauté a été résolu: https://jira.codehaus.org/browse/SONAR-926.\n\nCette présentation sera l'occasion de montre comment configurer, ou plutôt déconfigurer, le multi-langage dans SonarQube mais surtout d'en montrer les bénéfices. Nous verrons également comment ceci s'intègre dans l'IDE afin de raccourcir au maximum la boucle de rétroaction.",
        "speaker": "Olivier Gaudin",
        "format": "Tools in Action"
    },
    {
        "title": "Orika, mapping objet Java sans réflexion",
        "cospeaker": [
            
        ],
        "id": 151,
        "track": "Tooling",
        "description": "Après une bonne dose de réflexion, les développeurs Java disposent désormais de la bibliothèque Orika pour mapper des objets Java d'une couche logicielle à une autre. Orika utilise un générateur de bytecode pour créer des mappers très rapides : fini l'écriture manuelle d'une couche de mapping pour garder des performances correctes ! Dans ce Tools in Action, je vous montrerai ce qu'Orika a dans le ventre : de nombreuses fonctionnalités et d'excellentes performances. Vous n'aurez plus d'excuses pour exposer directement vos objets métiers dans votre couche d'interface REST.",
        "speaker": "Yoann Dubreuil",
        "format": "Tools in Action"
    },
    {
        "title": "\"Bash\" et moi",
        "cospeaker": [
            
        ],
        "id": 153,
        "track": "Tooling",
        "description": "La ligne de commandes vous fait peur ? Vous vous dites qu'un clic dans l'explorateur de fichier, c'est quand même plus simple et plus rapide qu'un 'ls' ou un 'cd' ? Venez découvrir qu'utiliser la ligne de commande n'est pas si terrible que ça, et qu'une fois bien apprivoisée, on gagne en efficacité et en expressivité. Je vous montrerai quelques trucs et astuces bien pratiques, du raccourci clavier à la commande magique en passant par quelques outils pour ceux qui regardent par la fenêtre le monde Unix ;) Venez avec les vôtres pour les partager à la fin de la session !",
        "speaker": "Yoann Dubreuil",
        "format": "Tools in Action"
    },
    {
        "title": "Délivrer en continu avec VSO et Windows Azure",
        "cospeaker": [
            
        ],
        "id": 155,
        "track": "Tooling",
        "description": "L'objectif de cette session est de rapidement présenter ce qu'est Visual Studio Online avec un focus sur les fonctions de gestion des développements, du code source avec GIT et de l'intégration continue. Ensuite, nous présenterons les principales caractéristiques des sites web Azure et des services Cloud Azure. Enfin, nous présenterons les liens entre Visual Studio Online et Windows Azure et comment on peut déployer en continue de sites web Azure ou des services cloud Azure.\n\nL'ensemble de la présentation sera illustrée par une démo en live.",
        "speaker": "François Bouteruche",
        "format": "Tools in Action"
    },
    {
        "title": "faire un jeu sur Leap Motion en Java",
        "cospeaker": [
            
        ],
        "id": 91,
        "track": "Internet of Things",
        "description": "La Leap Motion est un dispositif d'interface gestuelle. Cette session vous présente l'API Leap Motion en Java et comment l'utiliser avec le moteur de jeu 2D Hermes pour Processing.",
        "speaker": "Claude Falguiere",
        "format": "Tools in Action"
    },
    {
        "title": "Approche des architectures micro-services",
        "cospeaker": [
            
        ],
        "id": 77,
        "track": "Architecture",
        "description": "Les architectures orientées microservices sont encore un concept flou. On en trouve de nombreuses définitions et il est difficile de savoir comment en tirer un parti efficace pour son SI.\n\nVenez faire le tour des sources intéressantes sur le sujet, tirez la quintessence des visions offertes à la communauté, et des contraintes techniques qu'elles imposent. Nous passerons également en revue une implémentation possible d'architecture, puis une liste des frameworks et outils permettant d'expérimenter sur le sujet.",
        "speaker": "Aurélien Maury",
        "format": "Conférence"
    },
    {
        "title": "Une partie de cache-cache",
        "cospeaker": [
            
        ],
        "id": 102,
        "track": "Architecture",
        "description": "Les bonnes performances d'un site web passent inévitablement par l'exploitation des systèmes de cache.\n\n\"Cache-Control\", \"proxy public\", \"TTL\", \"hit ratio\", \"LRU/LFU\", \"CDN\", \"cache de longue traîne\", \"cache pré-construit\", \"cache froid / cache chaud\", \"hook 404\", \"cache mémoire ou fichier\", \"cache d'op-code\", \"tag ESI\", \"répartition\", sharding\", etc., dans cette jungle de terminologies pas toujours très claires, cette conférence tentera de faire une synthèse des technologies et solutions dont vous aurez besoin pour mettre au point une solution adaptée à vos contraintes.\n\nUn point sera également fait sur les pièges à éviter comme les problèmes de fraîcheur, la désynchronisation et le gel des pages.",
        "speaker": "Frederic Bouchery",
        "format": "Conférence"
    },
    {
        "title": "De zéro à héros en 5 minutes avec Spring Boot",
        "cospeaker": [
            
        ],
        "id": 117,
        "track": "Architecture",
        "description": "Si vous êtes un éternel impatient et que vous aimeriez une infrastructure pour vous aider à développer très rapidement des applications basées sur Spring, cette session est pour vous !  Spring Boot est une boîte à outils qui vous permet de développer vos applications en un temps record.  Durant cette session de démonstration, nous illustrerons les nombreuses possibilités de Spring Boot, notamment en terme de configuration et d'extensions.\n\nSpring Boot est une initiative relativement récente: la version 1.0 finale vient de sortir début avril et rend très facile la création d’applications en gérant un maximum de détails pour le développeur. On peut grossièrement catégoriser les objectifs de Boot de la façon suivante:\n\n* Fournir une micro-plateforme pour créer des applications autonomes  (`java -jar monapp.jar`) tout en permettant de les déployer dans un environnement “plus classique”.\n* En fonction des besoins, fournir un environnement qui se veut être fonctionnel et pratique, tout en permettant de le surcharger très facilement (partiellement ou globalement)\n* Fournir des fonctionnalités périphériques supplémentaires comme un rapport sur les beans déployés, des métriques, un endpoint qui valide que l’application est démarrée, etc\n* Etre un point central d’attention pour appréhender et utiliser très rapidement l’ensemble du portfolio Spring \n\nSpring Boot ne nécessite absolument pas de génération de code et ne va pas modifier votre code en quoi que ce soit. Le principe général, c’est que Boot va auto-configurer une série de services en fonction de conditions (typiquement est-ce que X est dans le classpath).  Il fournit des modules “starter” dont le but est de ramener les dépendances nécessaires pour utiliser le composant. En détectant le composant dans le classpath, l’application est prête à l’utiliser _par défaut_.",
        "speaker": "Stéphane Nicoll",
        "format": "Conférence"
    },
    {
        "title": "Le tour de Varnish en 80 jours",
        "cospeaker": [
            
        ],
        "id": 124,
        "track": "Architecture",
        "description": "Dans cette présentation, nous allons littéralement faire le tour du monde pour découvrir Varnish. L'outil connaît un succès fulgurant (on me souffle dans l'oreillette que c'est le cas aussi en France), il s'agit en fait d'un cache HTTP qui vous permet d'accélérer significativement votre trafic web. Sous le capot, on trouve une architecture moderne et réactive, mais je présente surtout Varnish tel que vous allez l'appréhender: un DSL élégant pour la politique de cache, et un ensemble d'outils simples pour l'administrer.",
        "speaker": "Dridi Boukelmoune",
        "format": "Conférence"
    },
    {
        "title": "How to scale ?",
        "cospeaker": [
            
        ],
        "id": 134,
        "track": "Architecture",
        "description": "Scaling is complicated. You need to design your application to be ready to upscale and/or outscale, and to be maintainable time to time. This talk is about that : which pattern, tools, way to work, are efficient to allow your application to scale.\n\nFirst given at dotscale 2013, this talk will be refreshed and adapted to the audience.",
        "speaker": "Quentin ADAM",
        "format": "Conférence"
    },
    {
        "title": "Maitriser le Temps: Event Sourcing",
        "cospeaker": [
            
        ],
        "id": 150,
        "track": "Architecture",
        "description": "Le temps qui passe dans nos système est un point critique pour la plupart des applications métier.\nMais que faisons nous pour l'appréhender ?\nQuelques horloges, threads et locks ne sont pas suffisant.\n\nL'**Event Sourcing** prend un point de vu radical et propose de placer la question du temps au centre du problème.\n\nBien que considéré souvent pour ses nombreux avantages techniques, l'Event Sourcing permet avant tout de modéliser concrètement le temps. \n\nAutour des concepts clés du temps et de la définition fonctionnelle de l'Event Sourcing, nous explorerons ce que cette technique apporte et comment aborder son implémentation.",
        "speaker": "Jérémie Chassaing",
        "format": "Conférence"
    },
    {
        "title": "Branchez Node.js à votre compteur EDF",
        "cospeaker": [
            
        ],
        "id": 131,
        "track": "Internet of Things",
        "description": "Venez voir comment coupler votre compteur EDF à une carte RaspberryPi / Beaglebone / ... pour avoir une vision temps réel de votre consommation électrique.\n\nCoté hardware, un montage électronique rudimentaire est utilisé (< 2 €).\n\nCoté soft, Node.js, MongoDB et AngularJS constituent les briques applicatives principales.",
        "speaker": "Laurent HUET",
        "format": "quickie"
    }
]